cplusplus/STL-algorithms.org
* 算法（algorithms）	
质变算法：会改变操作对象之值
非质变算法：和质变算法相反

** 数值算法
*** accumulate

accumulate用来计算init和[first, last)内所有元素的总和。
result = sum(#first, #last)
#+BEGIN_SRC C++
  template<class InputIterator, class T>
  T accumulate(InputIterator first, InputIterator last, T init)
  {
      for( ; first != last; ++first)
          init = init + *first;
      return init;
  }
  template<class InputIterator,class T, class BinaryOperation>
  T accumulate(InputIterator first, InputIterator last, T init, BinaryOperation binary_op)
  {
      for( ; first != last; ++first)
          init = binary_op(init, *first);
      return init;
  }
#+END_SRC
