cplusplus/STL-algorithms.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-20 二 17:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="hsin" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline64">1. 算法（algorithms）</a>
<ul>
<li><a href="#orgheadline7">1.1. 数值算法</a>
<ul>
<li><a href="#orgheadline1">1.1.1. accumulate</a></li>
<li><a href="#orgheadline2">1.1.2. adjacent<sub>difference</sub></a></li>
<li><a href="#orgheadline3">1.1.3. inner<sub>product</sub></a></li>
<li><a href="#orgheadline4">1.1.4. partial<sub>sum</sub></a></li>
<li><a href="#orgheadline5">1.1.5. power *</a></li>
<li><a href="#orgheadline6">1.1.6. itoa *</a></li>
</ul>
</li>
<li><a href="#orgheadline19">1.2. 基本算法</a>
<ul>
<li><a href="#orgheadline8">1.2.1. equal</a></li>
<li><a href="#orgheadline9">1.2.2. fill</a></li>
<li><a href="#orgheadline10">1.2.3. fill<sub>n</sub></a></li>
<li><a href="#orgheadline11">1.2.4. iter<sub>swap</sub></a></li>
<li><a href="#orgheadline12">1.2.5. lexicographical<sub>compare</sub></a></li>
<li><a href="#orgheadline13">1.2.6. max</a></li>
<li><a href="#orgheadline14">1.2.7. min</a></li>
<li><a href="#orgheadline15">1.2.8. mismatch</a></li>
<li><a href="#orgheadline16">1.2.9. swap</a></li>
<li><a href="#orgheadline17">1.2.10. copy &#x2013;强化效率无所不用其极</a></li>
<li><a href="#orgheadline18">1.2.11. copy<sub>backward</sub> &#x2013; 参照 copy</a></li>
</ul>
</li>
<li><a href="#orgheadline24">1.3. set 相关算法</a>
<ul>
<li><a href="#orgheadline20">1.3.1. set<sub>union</sub></a></li>
<li><a href="#orgheadline21">1.3.2. set<sub>intersection</sub></a></li>
<li><a href="#orgheadline22">1.3.3. set<sub>difference</sub></a></li>
<li><a href="#orgheadline23">1.3.4. set<sub>symmetric</sub><sub>difference</sub></a></li>
</ul>
</li>
<li><a href="#orgheadline29">1.4. heap 相关算法</a>
<ul>
<li><a href="#orgheadline25">1.4.1. make<sub>heap</sub></a></li>
<li><a href="#orgheadline26">1.4.2. pop<sub>heap</sub></a></li>
<li><a href="#orgheadline27">1.4.3. push<sub>heap</sub></a></li>
<li><a href="#orgheadline28">1.4.4. sort<sub>heap</sub></a></li>
</ul>
</li>
<li><a href="#orgheadline63">1.5. 其他算法</a>
<ul>
<li><a href="#orgheadline30">1.5.1. adjacent<sub>find</sub></a></li>
<li><a href="#orgheadline31">1.5.2. count</a></li>
<li><a href="#orgheadline32">1.5.3. count<sub>if</sub></a></li>
<li><a href="#orgheadline33">1.5.4. find 参照 count</a></li>
<li><a href="#orgheadline34">1.5.5. find<sub>if</sub> 参照 count<sub>if</sub></a></li>
<li><a href="#orgheadline35">1.5.6. find<sub>end</sub></a></li>
<li><a href="#orgheadline36">1.5.7. find<sub>first</sub><sub>of</sub> 参照 find<sub>end</sub></a></li>
<li><a href="#orgheadline37">1.5.8. for<sub>each</sub></a></li>
<li><a href="#orgheadline38">1.5.9. generate</a></li>
<li><a href="#orgheadline39">1.5.10. generate<sub>n</sub></a></li>
<li><a href="#orgheadline40">1.5.11. includes (应用于有序区间)</a></li>
<li><a href="#orgheadline41">1.5.12. max<sub>element</sub></a></li>
<li><a href="#orgheadline42">1.5.13. min<sub>element</sub> &#x2013; 参照 max<sub>element</sub></a></li>
<li><a href="#orgheadline43">1.5.14. merge (应用于有序空间)</a></li>
<li><a href="#orgheadline44">1.5.15. partition</a></li>
<li><a href="#orgheadline45">1.5.16. remove 移除（但不删除）</a></li>
<li><a href="#orgheadline46">1.5.17. remove<sub>copy</sub></a></li>
<li><a href="#orgheadline47">1.5.18. remove<sub>if</sub> &#x2013; 参照 remove</a></li>
<li><a href="#orgheadline48">1.5.19. remove<sub>copy</sub><sub>if</sub> &#x2013; 参照 remove<sub>copy</sub></a></li>
<li><a href="#orgheadline49">1.5.20. replace</a></li>
<li><a href="#orgheadline50">1.5.21. replace<sub>copy</sub></a></li>
<li><a href="#orgheadline51">1.5.22. replace<sub>if</sub> &#x2013; 参照 replace</a></li>
<li><a href="#orgheadline52">1.5.23. replace<sub>copy</sub><sub>if</sub> &#x2013; 参照 replace<sub>copy</sub></a></li>
<li><a href="#orgheadline53">1.5.24. reverse</a></li>
<li><a href="#orgheadline54">1.5.25. reverse<sub>copy</sub></a></li>
<li><a href="#orgheadline55">1.5.26. rotate</a></li>
<li><a href="#orgheadline56">1.5.27. rotate<sub>copy</sub></a></li>
<li><a href="#orgheadline57">1.5.28. search</a></li>
<li><a href="#orgheadline58">1.5.29. search<sub>n</sub></a></li>
<li><a href="#orgheadline59">1.5.30. swap<sub>ranges</sub></a></li>
<li><a href="#orgheadline60">1.5.31. transform</a></li>
<li><a href="#orgheadline61">1.5.32. unique</a></li>
<li><a href="#orgheadline62">1.5.33. unique<sub>copy</sub></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline64" class="outline-2">
<h2 id="orgheadline64"><span class="section-number-2">1</span> 算法（algorithms）</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.1</span> 数值算法</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> accumulate</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
accumulate用来计算init和[first, last)内所有元素的总和。
result = sum(#first, #last)
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">T</span> <span style="color: #0000ff; font-weight: bold;">accumulate</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">init</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span> ; first != last; ++first<span style="color: #7388d6;">)</span>
        init = init + *first;
    <span style="color: #00ffff; font-weight: bold;">return</span> init;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>,<span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BinaryOperation</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">T</span> <span style="color: #0000ff; font-weight: bold;">accumulate</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">init</span>, <span style="color: #00ff00;">BinaryOperation</span> <span style="color: #ffff00;">binary_op</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span> ; first != last; ++first<span style="color: #7388d6;">)</span>
        init = binary_op<span style="color: #7388d6;">(</span>init, *first<span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> init;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
