cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> adjacent<sub>difference</sub></h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
#n = #n - #n-1
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">adjacent_difference</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                                   <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>first == last<span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> result;
    *result = *first;
    <span style="color: #00ffff; font-weight: bold;">return</span> __adjacent_difference<span style="color: #7388d6;">(</span>first, last, result, value_type<span style="color: #909183;">(</span>first<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>,<span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">__adjacent_difference</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                                     <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, <span style="color: #00ff00;">T</span>*<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">value</span> = *first;
    <span style="color: #00ffff; font-weight: bold;">while</span><span style="color: #7388d6;">(</span>++first != last<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">tmp</span> = *first;
        *++result = tmp - value;
        value = tmp;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> ++result;
<span style="color: #707183;">}</span>

<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BinaryOperation</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">adjacent_difference</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                                   <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, <span style="color: #00ff00;">BinaryOperation</span> <span style="color: #ffff00;">binary_op</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>first == last<span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> result;
    *result = *first;
    <span style="color: #00ffff; font-weight: bold;">return</span> __adjacent_difference<span style="color: #7388d6;">(</span>first, last, result, value_type<span style="color: #909183;">(</span>first<span style="color: #909183;">)</span>,
                                 binary_op<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>,<span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">__adjacent_difference</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                                     <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, <span style="color: #00ff00;">T</span>*, <span style="color: #00ff00;">BinaryOperation</span> <span style="color: #ffff00;">binary_op</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">value</span> = *first;
    <span style="color: #00ffff; font-weight: bold;">while</span><span style="color: #7388d6;">(</span>++first != last<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">tmp</span> = *first;
        *++result = binary_op<span style="color: #909183;">(</span>tmp,value<span style="color: #909183;">)</span>;
        value = tmp;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> ++result;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.1.3</span> inner<sub>product</sub></h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
init += n1 * n2
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span>,<span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">T</span> <span style="color: #0000ff; font-weight: bold;">inner_product</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last1</span>,
                <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">init</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first1 != last1; ++first1,++first2<span style="color: #7388d6;">)</span>
        init = init + <span style="color: #7388d6;">(</span>*first1 * *first2<span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> init;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span>,<span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span>,
         <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BinaryOperation1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BinaryOperation2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">T</span> <span style="color: #0000ff; font-weight: bold;">inner_product</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last1</span>,
                <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">init</span>, <span style="color: #00ff00;">BinaryOperation1</span> <span style="color: #ffff00;">binary_op1</span>,
                <span style="color: #00ff00;">BinaryOperation2</span> <span style="color: #ffff00;">binary_op2</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first1 != last1; ++first1,++first2<span style="color: #7388d6;">)</span>
        init = binary_op1<span style="color: #7388d6;">(</span>init, binary_op2<span style="color: #909183;">(</span>*first1, *first2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> init;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
