cplusplus/STL-algorithms.org
*** partial_sum

#n = sum(#first, #n)
#+BEGIN_SRC C++
  template<class InputIterator, class OutputIterator>
  OutputIterator partial_sum(InputIterator first, InputIterator last,
                             OutputIterator result)
  {
      if(first == last) return result;
      ,*result = *first;
      return __partial_sum(first, last, result, value_type(first));
  }
  template<class InputIterator, class OutputIterator,class T>
  OutputIterator __partial_sum(InputIterator first, InputIterator last,
                               OutputIterator result, T*)
  {
      T value = *first;
      while(++first != last) {
          value = value + *first;
          ,*++result = value;
      }
      return ++result;
  }
  template<class InputIterator, class OutputIterator, class BinaryOperation>
  OutputIterator partial_sum(InputIterator first, InputIterator last,
                             OutputIterator result, BinaryOperation binary_op)
  {
      if(first == last) return result;
      ,*result = *first;
      return __partial_sum(first, last, result, value_type(first), binary_op);
  }
  template<class InputIterator, class OutputIterator,class T>
  OutputIterator __partial_sum(InputIterator first, InputIterator last,
                               OutputIterator result, T*,
                               BinaryOperation binary_op)
  {
      T value = *first;
      while(++first != last) {
          value = binary_op(value, *first);
          ,*++result = value;
      }
      return ++result;
  }
#+END_SRC
*** power *

#+BEGIN_SRC c++
  template<class T, class Interger>
  inline T power(T x, Interger n)
  {
      return power(x, n, multiplies<T>());
  }
  template<class T, class Interger, class MonoidOperation>
  T power(T x, Interger n, MonoidOperation op)
  {
      if(n == 0)
          return identity_element(op);
      else {
          //确定 x的m次 值， 为了不重复计算，看n是否能被 x的m次 整除，通过移位便可确定
          while ((n & 1) == 0) {
              n >>= 1;
              x = op(x, x);
          }
          //也是为了不重复计算，把x的n次拆分成2^m+2^(m-1)+2^(m-2)+...+1
          //先算出1次，再算出2次，再算出4次。只要对应位置上有数，加进reslt就行，
          //没有数则不加。
          T result = x;
          n >>= 1;
          while (n != 0) {
              x = op(x, x);
              if((n & 1) != 0)
                  result = op(result, x);
              n >>= 1;
          }
          return result;
      }
  }
#+END_SRC    
