cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.1.4</span> partial<sub>sum</sub></h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
#n = sum(#first, #n)
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">partial_sum</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                           <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>first == last<span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> result;
    *result = *first;
    <span style="color: #00ffff; font-weight: bold;">return</span> __partial_sum<span style="color: #7388d6;">(</span>first, last, result, value_type<span style="color: #909183;">(</span>first<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>,<span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">__partial_sum</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                             <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, <span style="color: #00ff00;">T</span>*<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">value</span> = *first;
    <span style="color: #00ffff; font-weight: bold;">while</span><span style="color: #7388d6;">(</span>++first != last<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        value = value + *first;
        *++result = value;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> ++result;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BinaryOperation</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">partial_sum</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                           <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, <span style="color: #00ff00;">BinaryOperation</span> <span style="color: #ffff00;">binary_op</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>first == last<span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> result;
    *result = *first;
    <span style="color: #00ffff; font-weight: bold;">return</span> __partial_sum<span style="color: #7388d6;">(</span>first, last, result, value_type<span style="color: #909183;">(</span>first<span style="color: #909183;">)</span>, binary_op<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>,<span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">__partial_sum</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                             <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, <span style="color: #00ff00;">T</span>*,
                             <span style="color: #00ff00;">BinaryOperation</span> <span style="color: #ffff00;">binary_op</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">value</span> = *first;
    <span style="color: #00ffff; font-weight: bold;">while</span><span style="color: #7388d6;">(</span>++first != last<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        value = binary_op<span style="color: #909183;">(</span>value, *first<span style="color: #909183;">)</span>;
        *++result = value;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> ++result;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">1.1.5</span> power *</h4>
<div class="outline-text-4" id="text-1-1-5">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Interger</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">T</span> <span style="color: #0000ff; font-weight: bold;">power</span><span style="color: #707183;">(</span><span style="color: #00ff00;">T</span> <span style="color: #ffff00;">x</span>, <span style="color: #00ff00;">Interger</span> <span style="color: #ffff00;">n</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> power<span style="color: #7388d6;">(</span>x, n, <span style="color: #00ff00;">multiplies</span><span style="color: #909183;">&lt;</span><span style="color: #00ff00;">T</span><span style="color: #909183;">&gt;()</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Interger</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">MonoidOperation</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">T</span> <span style="color: #0000ff; font-weight: bold;">power</span><span style="color: #707183;">(</span><span style="color: #00ff00;">T</span> <span style="color: #ffff00;">x</span>, <span style="color: #00ff00;">Interger</span> <span style="color: #ffff00;">n</span>, <span style="color: #00ff00;">MonoidOperation</span> <span style="color: #ffff00;">op</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>n == <span style="color: #ff00ff;">0</span><span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">return</span> identity_element<span style="color: #7388d6;">(</span>op<span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #7388d6;">{</span>
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#30830;&#23450; x&#30340;m&#27425; &#20540;&#65292; &#20026;&#20102;&#19981;&#37325;&#22797;&#35745;&#31639;&#65292;&#30475;n&#26159;&#21542;&#33021;&#34987; x&#30340;m&#27425; &#25972;&#38500;&#65292;&#36890;&#36807;&#31227;&#20301;&#20415;&#21487;&#30830;&#23450;</span>
        <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #00ff00;">n</span> &amp; <span style="color: #ff00ff;">1</span><span style="color: #709870;">)</span> == <span style="color: #ff00ff;">0</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            n &gt;&gt;= <span style="color: #ff00ff;">1</span>;
            x = op<span style="color: #709870;">(</span>x, x<span style="color: #709870;">)</span>;
        <span style="color: #909183;">}</span>
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#20063;&#26159;&#20026;&#20102;&#19981;&#37325;&#22797;&#35745;&#31639;&#65292;&#25226;x&#30340;n&#27425;&#25286;&#20998;&#25104;2^m+2^(m-1)+2^(m-2)+...+1</span>
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#20808;&#31639;&#20986;1&#27425;&#65292;&#20877;&#31639;&#20986;2&#27425;&#65292;&#20877;&#31639;&#20986;4&#27425;&#12290;&#21482;&#35201;&#23545;&#24212;&#20301;&#32622;&#19978;&#26377;&#25968;&#65292;&#21152;&#36827;reslt&#23601;&#34892;&#65292;</span>
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#27809;&#26377;&#25968;&#21017;&#19981;&#21152;&#12290;</span>
        <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">result</span> = x;
        n &gt;&gt;= <span style="color: #ff00ff;">1</span>;
        <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #909183;">(</span>n != <span style="color: #ff00ff;">0</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            x = op<span style="color: #709870;">(</span>x, x<span style="color: #709870;">)</span>;
            <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #00ff00;">n</span> &amp; <span style="color: #ff00ff;">1</span><span style="color: #907373;">)</span> != <span style="color: #ff00ff;">0</span><span style="color: #709870;">)</span>
                result = op<span style="color: #709870;">(</span>result, x<span style="color: #709870;">)</span>;
            n &gt;&gt;= <span style="color: #ff00ff;">1</span>;
        <span style="color: #909183;">}</span>
        <span style="color: #00ffff; font-weight: bold;">return</span> result;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
