cplusplus/STL-algorithms.org
*** itoa *

#+BEGIN_SRC C++
  template<class ForwardIterator, class T>
  void itoa(ForwardIterator first, ForwardIterator last, T value)
  {
      while(first != last)
          ,*first++ = value++;
  }
#+END_SRC
** 基本算法
*** equal

#+BEGIN_SRC C++
  template<class InputIterator1, class InputIterator2>
  inline bool equal(InputIterator1 first1, InputIterator1 last1,
                    InputIterator2 first2)
  {
      for( ; first1 != last1; ++first1,++first2)
          if(*first1 != *first2)
              return false;
      return true;
  }
  template<class InputIterator1, class InputIterator2, class BinaryPredicate>
  inline bool equal(InputIterator1 first1, InputIterator1 last1,
                    InputIterator2 first2, BinaryPredicate binary_op)
  {
      for( ; first != last1; ++first1,++first2)
          if(!binary_op(*first1,*first2))
              return false;
      return true;
  }
#+END_SRC
*** fill

将[first, last)内的元素改填新值。
#+BEGIN_SRC C++
  template<class ForwardIterator, class T>
  void fill(ForwardIterator first, ForwardIterator last, const T& value)
  {
      for(; first != last; ++first)
          ,*first = value;
  }
#+END_SRC
*** fill_n

将[first, first + n)内的元素改填新值。
避免书写越界可利用inserter()产生一个具有插入（insert）而非覆写（overwrite）能力的迭代器
#+BEGIN_SRC C++
  template<class OutputIterator, class Size, class T>
  OutputIterator fill_n(OutputIterator first, Size n, const T& value)
  {
      for(; n >0 ; --n, ++first)
          ,*first = value;
      return first;
  }
#+END_SRC
*** iter_swap

将两个ForwardIterator所指向的对象对调。
#+BEGIN_SRC C++
  template<class ForwardIterator1, class ForwardIterator2>
  inline void iter_swap(ForwardIterator1 a, ForwardIterator2 b)
  {
      __iter_swap(a, b, value_type(a));
  }
  template<class ForwardIterator1, class ForwardIterator2, class T>
  inline void __iter_swap(ForwardIterator1 a, ForwardIterator2 b, T*)
  {
      T tmp = *a;
      *a = *b;
      *b = tmp;
  }
#+END_SRC
