cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">1.1.6</span> itoa *</h4>
<div class="outline-text-4" id="text-1-1-6">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">itoa</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">value</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span><span style="color: #7388d6;">(</span>first != last<span style="color: #7388d6;">)</span>
        *first++ = value++;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">1.2</span> 基本算法</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">1.2.1</span> equal</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">bool</span> <span style="color: #0000ff; font-weight: bold;">equal</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">last1</span>,
                  <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span> ; first1 != last1; ++first1,++first2<span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>*first1 != *first2<span style="color: #7388d6;">)</span>
            <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #ff00ff;">false</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #ff00ff;">true</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BinaryPredicate</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">bool</span> <span style="color: #0000ff; font-weight: bold;">equal</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">last1</span>,
                  <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">BinaryPredicate</span> <span style="color: #ffff00;">binary_op</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span> ; first != last1; ++first1,++first2<span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>!binary_op<span style="color: #909183;">(</span>*first1,*first2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #ff00ff;">false</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #ff00ff;">true</span>;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">1.2.2</span> fill</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
将[first, last)内的元素改填新值。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">fill</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">value</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first != last; ++first<span style="color: #7388d6;">)</span>
        *first = value;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">1.2.3</span> fill<sub>n</sub></h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
将[first, first + n)内的元素改填新值。
避免书写越界可利用inserter()产生一个具有插入（insert）而非覆写（overwrite）能力的迭代器
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Size</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">fill_n</span><span style="color: #707183;">(</span><span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">Size</span> <span style="color: #ffff00;">n</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">value</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; n &gt;<span style="color: #ff00ff;">0</span> ; --n, ++first<span style="color: #7388d6;">)</span>
        *first = value;
    <span style="color: #00ffff; font-weight: bold;">return</span> first;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">1.2.4</span> iter<sub>swap</sub></h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
将两个ForwardIterator所指向的对象对调。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">iter_swap</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">a</span>, <span style="color: #00ff00;">ForwardIterator2</span> <span style="color: #ffff00;">b</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    __iter_swap<span style="color: #7388d6;">(</span>a, b, value_type<span style="color: #909183;">(</span>a<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator2</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">__iter_swap</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">a</span>, <span style="color: #00ff00;">ForwardIterator2</span> <span style="color: #ffff00;">b</span>, <span style="color: #00ff00;">T</span>*<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">tmp</span> = *a;
    *a = *b;
    *b = tmp;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
