cplusplus/STL-algorithms.org
*** lexicographical_compare

以“字典排列方式”对两个序列[first1, last1)和[first2, last2)进行比较。
#+BEGIN_SRC C++
  template<class InputIterator1, class InputIterator2>
  bool lexicographical_compare(InputIterator1 first1, InputIterator1 last1,
                               InputIterator2 first2, InputIterator2 last2)
  {
      for(; first1 != last1 && first2 != last2; ++first1, ++first2)
      {
          if(*first1 < *first2)
              return true;
          if(*first2 < *first1)
              return false
      }
      return first1 == last1 && first2 != last2;
  }
  template<class InputIterator1, class InputIterator2, class Compare>
  bool lexicographical_compare(InputIterator1 first1, InputIterator1 last1,
                               InputIterator2 first2, InputIterator2 last2,
                               Compare comp)
  {
      for(; first1 != last1 && first2 != last2; ++first1, ++first2)
      {
          if(comp(*first1, *first2))
              return true;
          if(comp(*first2, *first1))
              return false
      }
      return first1 == last1 && first2 != last2;
  }
#+END_SRC

为了增进效率，SGI还设计了一个特化版本用于原生指针 const unsigned char *:
#+BEGIN_SRC C++
  inline bool
  lexicographical_compare(const unsigned char* first1, const unsigned char* last1,
                          const unsigned char* first2, const unsigned char* last2)
  {
      const size_t len1 = last1 - first1;
      const size_t len2 = last2 - first2;
      const int result = memcmp(first1, first2, min(len1, len2));
      return result != 0 ? result < 0 : len1 < len2;
  }
#+END_SRC
*** max

取两个对象中的较大值。
#+BEGIN_SRC C++
  template<class T>
  inline const T& max(const T& a, const T& b)
  {
      return a < b ? b : a;
  }
  template<class T, class Compare>
  inline const T& max(const T& a, const T& b, Compare comp)
  {
      return comp(a, b) ? b : a;
  }
#+END_SRC
*** min

取两个对象中的较小值。
#+BEGIN_SRC C++
  template<class T>
  inline const T& min(const T& a, const T& b)
  {
      return b < a ? b : a;
  }
  template<class T, class Compare>
  inline const T& min(const T& a, const T& b, Compare comp)
  {
      return comp(b,a) ? b : a;
  }
#+END_SRC
