cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">1.2.5</span> lexicographical<sub>compare</sub></h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
以“字典排列方式”对两个序列[first1, last1)和[first2, last2)进行比较。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">bool</span> <span style="color: #0000ff; font-weight: bold;">lexicographical_compare</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">last1</span>,
                             <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">last2</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first1 != last1 &amp;&amp; first2 != last2; ++first1, ++first2<span style="color: #7388d6;">)</span>
    <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>*first1 &lt; *first2<span style="color: #909183;">)</span>
            <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #ff00ff;">true</span>;
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>*first2 &lt; *first1<span style="color: #909183;">)</span>
            <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #ff00ff;">false</span>
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> first1 == last1 &amp;&amp; first2 != last2;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Compare</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">bool</span> <span style="color: #0000ff; font-weight: bold;">lexicographical_compare</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">last1</span>,
                             <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">last2</span>,
                             <span style="color: #00ff00;">Compare</span> <span style="color: #ffff00;">comp</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first1 != last1 &amp;&amp; first2 != last2; ++first1, ++first2<span style="color: #7388d6;">)</span>
    <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>comp<span style="color: #709870;">(</span>*first1, *first2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
            <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #ff00ff;">true</span>;
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>comp<span style="color: #709870;">(</span>*first2, *first1<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
            <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #ff00ff;">false</span>
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> first1 == last1 &amp;&amp; first2 != last2;
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
为了增进效率，SGI还设计了一个特化版本用于原生指针 const unsigned char *:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">bool</span>
<span style="color: #0000ff; font-weight: bold;">lexicographical_compare</span><span style="color: #707183;">(</span><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">unsigned</span> <span style="color: #00ff00;">char</span>* <span style="color: #ffff00;">first1</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">unsigned</span> <span style="color: #00ff00;">char</span>* <span style="color: #ffff00;">last1</span>,
                        <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">unsigned</span> <span style="color: #00ff00;">char</span>* <span style="color: #ffff00;">first2</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">unsigned</span> <span style="color: #00ff00;">char</span>* <span style="color: #ffff00;">last2</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">size_t</span> <span style="color: #ffff00;">len1</span> = last1 - first1;
    <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">size_t</span> <span style="color: #ffff00;">len2</span> = last2 - first2;
    <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">int</span> <span style="color: #ffff00;">result</span> = memcmp<span style="color: #7388d6;">(</span>first1, first2, min<span style="color: #909183;">(</span>len1, len2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> result != <span style="color: #ff00ff;">0</span> ? result &lt; <span style="color: #ff00ff;">0</span> : len1 &lt; len2;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">1.2.6</span> max</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
取两个对象中的较大值。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #0000ff; font-weight: bold;">max</span><span style="color: #707183;">(</span><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">a</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">b</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> a &lt; b ? b : a;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Compare</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #0000ff; font-weight: bold;">max</span><span style="color: #707183;">(</span><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">a</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">b</span>, <span style="color: #00ff00;">Compare</span> <span style="color: #ffff00;">comp</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> comp<span style="color: #7388d6;">(</span>a, b<span style="color: #7388d6;">)</span> ? b : a;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-4">
<h4 id="orgheadline14"><span class="section-number-4">1.2.7</span> min</h4>
<div class="outline-text-4" id="text-1-2-7">
<p>
取两个对象中的较小值。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #0000ff; font-weight: bold;">min</span><span style="color: #707183;">(</span><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">a</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">b</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> b &lt; a ? b : a;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Compare</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #0000ff; font-weight: bold;">min</span><span style="color: #707183;">(</span><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">a</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">b</span>, <span style="color: #00ff00;">Compare</span> <span style="color: #ffff00;">comp</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> comp<span style="color: #7388d6;">(</span>b,a<span style="color: #7388d6;">)</span> ? b : a;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
