cplusplus/STL-algorithms.org
*** mismatch

用来平行比较两个序列，指出两者之间的第一个不匹配点。返回一对迭代器（pair），分别指向两序列中的不匹配点。
#+BEGIN_SRC C++
  template<class InputIterator1, class InputIterator2>
  pair<InputIterator1, InputIterator2> mismatch(InputIterator1 first1, InputIterator1 last1,
                                                InputIterator2 first2)
  {
      while (first != last1 && *first1 == *first2) {
          ++first1;
          ++first2;
      }
      return pair<InputIterator1, InputIterator2>(first1, first2);
  }
  template<class InputIterator1, class InputIterator2, class BinaryPredicate>
  pair<InputIterator1, InputIterator2> mismatch( InputIterator1 first1,InputIterator1 last1,
                                                 InputIterator2 first2, BinaryPredicate binary_pred)
  {
      while (first1 != last1 && binary_pred(*first1, *first2)) {
          ++first1;
          ++first2;
      }
      return pair<InputIterator1, InputIterator2>(first1, first2);
  }
#+END_SRC
*** swap

用来交换（对调）两个对象的内容。
#+BEGIN_SRC C++
  template<class T>
  inline void swap(T& a, T& b)
  {
      T tmp = a;
      a = b;
      b = tmp;
  }
#+END_SRC
