cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">1.2.8</span> mismatch</h4>
<div class="outline-text-4" id="text-1-2-8">
<p>
用来平行比较两个序列，指出两者之间的第一个不匹配点。返回一对迭代器（pair），分别指向两序列中的不匹配点。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">pair</span><span style="color: #707183;">&lt;</span><span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ff00;">InputIterator2</span><span style="color: #707183;">&gt;</span> <span style="color: #0000ff; font-weight: bold;">mismatch</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">last1</span>,
                                              <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>first != last1 &amp;&amp; *first1 == *first2<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        ++first1;
        ++first2;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #00ff00;">pair</span><span style="color: #7388d6;">&lt;</span>InputIterator1, InputIterator2<span style="color: #7388d6;">&gt;(</span>first1, first2<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BinaryPredicate</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">pair</span><span style="color: #707183;">&lt;</span><span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ff00;">InputIterator2</span><span style="color: #707183;">&gt;</span> <span style="color: #0000ff; font-weight: bold;">mismatch</span><span style="color: #707183;">(</span> <span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>,<span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">last1</span>,
                                               <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">BinaryPredicate</span> <span style="color: #ffff00;">binary_pred</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>first1 != last1 &amp;&amp; binary_pred<span style="color: #909183;">(</span>*first1, *first2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        ++first1;
        ++first2;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #00ff00;">pair</span><span style="color: #7388d6;">&lt;</span>InputIterator1, InputIterator2<span style="color: #7388d6;">&gt;(</span>first1, first2<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16"><span class="section-number-4">1.2.9</span> swap</h4>
<div class="outline-text-4" id="text-1-2-9">
<p>
用来交换（对调）两个对象的内容。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">swap</span><span style="color: #707183;">(</span><span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">a</span>, <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">b</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">tmp</span> = a;
    a = b;
    b = tmp;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
