cplusplus/STL-algorithms.org
*** copy --强化效率无所不用其极

泛化
#+BEGIN_SRC C++
  template<class InputIterator, class OutputIterator>
  inline OutputIterator copy(InputIterator first, InputIterator last,
                             OutputIterator result)
  {
      return __copy_dispatch<InputIterator,OutputIterator>()
          (first, last, result);
  }
  template<class InputIterator, char OutputIterator>
  struct __copy_dispatch
  {
      OutputIterator operator()(InputIterator first, InputIterator last,
                                OutputIterator result) {
          //传入一个迭代器标签，区分是否是随机迭代器
          return __copy(first, last, result, iterator_category(first));
      }
  };
  // 指针特化
  template<class T>
  struct __copy_dispatch<T*, T*>
  {
      T* operator()(T* first, T* last, T* result) {
          //判断 是否 没有 assignment_operator重载操作
          typedef typename __type_traits<T>::has_trivial_assignment_operator t;
          return __copy_t(first, last, result, t());
      }
  };
  // const指针特化 
  template<class T>
  struct __copy_dispatch<const T*, T*>
  {
      T* operator()(const T* first, const T* last, T* result) {
          typedef typename __type_traits<T>:: has_trivial_assignment_operator t;
          return __copy_t(first, last, result, t());
      }
  };
  //input是基类，不管forward 还是bidi迭代器都走这边
  template<class InputIterator, class OutputIterator>
  inline OutputIterator __copy(InputIterator first, InputIterator last,
                               OutputIterator result, input_iterator_tag)
  {
      for(; first != last; ++result, ++first)
          ,*result = *first;
      return result;
  }
  //随机迭代器走这边
  template<class RandomAccessIterator, class OutputIterator>
  inline OutputIterator __copy(RandomAccessIterator first, RandomAccessIterator last,
                               OutputIterator result, random_access_iterator_tag)
  {
      return __copy_d(first, last, result, distance_type(first));
  }
  //直接算出区间大小，根据大小来循环 不需要判断迭代是否相等，可以有效提升速度
  template<class RandomAccessIterator, class OutputIterator, class Distance>
  inline OutputIterator
  __copy_d(RandomAccessIterator first, RandomAccessIterator last,
           OutputIterator result, Distance*)
  {
      for(Distance n = last - first; n > 0; --n, ++result, ++first )
          ,*result = *first;
      return result;
  }
  //是 没有assignment_operator重载操作的话 就走这。直接复制内存
  template<class T>
  inline T* __copy_t(const T* first, const T* last, T* result, __true_type)
  {
      memmove(result, first, sizeof(T) * (last - first));
      return result + (last - first);
  }
  //不是 没有assignment_operator重载操作(也就是有重载) 走这边，调用随机迭代器的copy方法
  template<class T>
  inline T* __copy_t(const T* first, const T* last, T* result,
                     __false_type)
  {
      return __copy_d(first, last, result, (ptrdiff_t*) 0);
  }
#+END_SRC

特化
#+BEGIN_SRC C++
  inline char* copy(const char* first, const char* last, char* result)
  {
      memmove(result, first, last - first);
      return result + (last - first);
  }
  inline wchar_t* copy(const wchar_t* first, const wchar_t* last,
                       const wchar_t* result)
  {
      memmove(result, first, sizeof(wchar_t) * (last - first));
      return result + (last - first);
  }
#+END_SRC
