cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17"><span class="section-number-4">1.2.10</span> copy &#x2013;强化效率无所不用其极</h4>
<div class="outline-text-4" id="text-1-2-10">
<p>
泛化
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">copy</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                           <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #00ff00;">__copy_dispatch</span><span style="color: #7388d6;">&lt;</span>InputIterator,OutputIterator<span style="color: #7388d6;">&gt;()</span>
        <span style="color: #7388d6;">(</span>first, last, result<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ff00;">char</span> <span style="color: #ffff00;">OutputIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">struct</span> <span style="color: #00ff00;">__copy_dispatch</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">OutputIterator</span> <span style="color: #00ffff; font-weight: bold;">operator</span><span style="color: #7388d6; font-weight: bold;">()</span><span style="color: #7388d6;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                              <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#20256;&#20837;&#19968;&#20010;&#36845;&#20195;&#22120;&#26631;&#31614;&#65292;&#21306;&#20998;&#26159;&#21542;&#26159;&#38543;&#26426;&#36845;&#20195;&#22120;</span>
        <span style="color: #00ffff; font-weight: bold;">return</span> __copy<span style="color: #909183;">(</span>first, last, result, <span style="color: #00ff00;">iterator_category</span><span style="color: #709870;">(</span><span style="color: #ffff00;">first</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>;
<span style="color: #ff0000;">// </span><span style="color: #ff0000;">&#25351;&#38024;&#29305;&#21270;</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">struct</span> <span style="color: #00ff00;">__copy_dispatch</span><span style="color: #707183;">&lt;</span><span style="color: #00ff00;">T</span>*, <span style="color: #00ff00;">T</span>*<span style="color: #707183;">&gt;</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">T</span>* <span style="color: #00ffff; font-weight: bold;">operator</span><span style="color: #7388d6; font-weight: bold;">()</span><span style="color: #7388d6;">(</span><span style="color: #00ff00;">T</span>* <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">T</span>* <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">T</span>* <span style="color: #ffff00;">result</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#21028;&#26029; &#26159;&#21542; &#27809;&#26377; assignment_operator&#37325;&#36733;&#25805;&#20316;</span>
        <span style="color: #00ffff; font-weight: bold;">typedef</span> <span style="color: #00ffff; font-weight: bold;">typename</span> <span style="color: #ff00ff;">__type_traits</span><span style="color: #909183;">&lt;</span><span style="color: #00ff00;">T</span><span style="color: #909183;">&gt;</span>::<span style="color: #00ff00;">has_trivial_assignment_operator</span> <span style="color: #00ff00;">t</span>;
        <span style="color: #00ffff; font-weight: bold;">return</span> __copy_t<span style="color: #909183;">(</span>first, last, result, <span style="color: #00ff00;">t</span><span style="color: #709870;">()</span><span style="color: #909183;">)</span>;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>;
<span style="color: #ff0000;">// </span><span style="color: #ff0000;">const&#25351;&#38024;&#29305;&#21270; </span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">struct</span> <span style="color: #00ff00;">__copy_dispatch</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>*, <span style="color: #00ff00;">T</span>*<span style="color: #707183;">&gt;</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">T</span>* <span style="color: #00ffff; font-weight: bold;">operator</span><span style="color: #7388d6; font-weight: bold;">()</span><span style="color: #7388d6;">(</span><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>* <span style="color: #ffff00;">first</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>* <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">T</span>* <span style="color: #ffff00;">result</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">typedef</span> <span style="color: #00ffff; font-weight: bold;">typename</span> <span style="color: #ff00ff;">__type_traits</span><span style="color: #909183;">&lt;</span><span style="color: #00ff00;">T</span><span style="color: #909183;">&gt;</span>:: <span style="color: #00ff00;">has_trivial_assignment_operator</span> <span style="color: #00ff00;">t</span>;
        <span style="color: #00ffff; font-weight: bold;">return</span> __copy_t<span style="color: #909183;">(</span>first, last, result, <span style="color: #00ff00;">t</span><span style="color: #709870;">()</span><span style="color: #909183;">)</span>;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>;
<span style="color: #ff0000;">//</span><span style="color: #ff0000;">input&#26159;&#22522;&#31867;&#65292;&#19981;&#31649;forward &#36824;&#26159;bidi&#36845;&#20195;&#22120;&#37117;&#36208;&#36825;&#36793;</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">__copy</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                             <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, input_iterator_tag<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first != last; ++result, ++first<span style="color: #7388d6;">)</span>
        *result = *first;
    <span style="color: #00ffff; font-weight: bold;">return</span> result;
<span style="color: #707183;">}</span>
<span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#38543;&#26426;&#36845;&#20195;&#22120;&#36208;&#36825;&#36793;</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">RandomAccessIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">__copy</span><span style="color: #707183;">(</span><span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">last</span>,
                             <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, random_access_iterator_tag<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> __copy_d<span style="color: #7388d6;">(</span>first, last, result, distance_type<span style="color: #909183;">(</span>first<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#30452;&#25509;&#31639;&#20986;&#21306;&#38388;&#22823;&#23567;&#65292;&#26681;&#25454;&#22823;&#23567;&#26469;&#24490;&#29615; &#19981;&#38656;&#35201;&#21028;&#26029;&#36845;&#20195;&#26159;&#21542;&#30456;&#31561;&#65292;&#21487;&#20197;&#26377;&#25928;&#25552;&#21319;&#36895;&#24230;</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">RandomAccessIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Distance</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">OutputIterator</span>
<span style="color: #0000ff; font-weight: bold;">__copy_d</span><span style="color: #707183;">(</span><span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">last</span>,
         <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, <span style="color: #00ff00;">Distance</span>*<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span><span style="color: #00ff00;">Distance</span> <span style="color: #ffff00;">n</span> = last - first; n &gt; <span style="color: #ff00ff;">0</span>; --n, ++result, ++first <span style="color: #7388d6;">)</span>
        *result = *first;
    <span style="color: #00ffff; font-weight: bold;">return</span> result;
<span style="color: #707183;">}</span>
<span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#26159; &#27809;&#26377;assignment_operator&#37325;&#36733;&#25805;&#20316;&#30340;&#35805; &#23601;&#36208;&#36825;&#12290;&#30452;&#25509;&#22797;&#21046;&#20869;&#23384;</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">T</span>* <span style="color: #0000ff; font-weight: bold;">__copy_t</span><span style="color: #707183;">(</span><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>* <span style="color: #ffff00;">first</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>* <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">T</span>* <span style="color: #ffff00;">result</span>, __true_type<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    memmove<span style="color: #7388d6;">(</span>result, first, <span style="color: #00ffff; font-weight: bold;">sizeof</span><span style="color: #909183;">(</span>T<span style="color: #909183;">)</span> * <span style="color: #909183;">(</span>last - first<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> result + <span style="color: #7388d6;">(</span>last - first<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#19981;&#26159; &#27809;&#26377;assignment_operator&#37325;&#36733;&#25805;&#20316;(&#20063;&#23601;&#26159;&#26377;&#37325;&#36733;) &#36208;&#36825;&#36793;&#65292;&#35843;&#29992;&#38543;&#26426;&#36845;&#20195;&#22120;&#30340;copy&#26041;&#27861;</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">T</span>* <span style="color: #0000ff; font-weight: bold;">__copy_t</span><span style="color: #707183;">(</span><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>* <span style="color: #ffff00;">first</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>* <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">T</span>* <span style="color: #ffff00;">result</span>,
                   __false_type<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> __copy_d<span style="color: #7388d6;">(</span>first, last, result, <span style="color: #909183;">(</span><span style="color: #00ff00;">ptrdiff_t</span>*<span style="color: #909183;">)</span> <span style="color: #ff00ff;">0</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
特化
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">char</span>* <span style="color: #0000ff; font-weight: bold;">copy</span><span style="color: #707183;">(</span><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">char</span>* <span style="color: #ffff00;">first</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">char</span>* <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">char</span>* <span style="color: #ffff00;">result</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    memmove<span style="color: #7388d6;">(</span>result, first, last - first<span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> result + <span style="color: #7388d6;">(</span>last - first<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">wchar_t</span>* <span style="color: #0000ff; font-weight: bold;">copy</span><span style="color: #707183;">(</span><span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">wchar_t</span>* <span style="color: #ffff00;">first</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">wchar_t</span>* <span style="color: #ffff00;">last</span>,
                     <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">wchar_t</span>* <span style="color: #ffff00;">result</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    memmove<span style="color: #7388d6;">(</span>result, first, <span style="color: #00ffff; font-weight: bold;">sizeof</span><span style="color: #909183;">(</span><span style="color: #00ff00;">wchar_t</span><span style="color: #909183;">)</span> * <span style="color: #909183;">(</span>last - first<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> result + <span style="color: #7388d6;">(</span>last - first<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
