cplusplus/STL-algorithms.org
*** copy_backward -- 参照 copy

将[first,last)区间内的每一个元素，以逆行的方向复制到以result-1为起点，方向亦为逆行的区间上。

#+BEGIN_SRC C++
  template<class BidirectionalIterator1, class BidirectionalIterator2>
  inline BidirectionalIterator2 copy( BidirectionalIterator1 first,
                                      BidirectionalIterator1 last,
                                      BidirectionalIterator2 result);
#+END_SRC
copy_backward 所接受的迭代器必须是BidirectionalTterators, 才能够“倒行逆施”。

** set 相关算法
STL一共提供了四种与set（集合）相关的算法，分别是并集（union）、交集（intersection）、差集（difference）、对称差集（symmetric difference）。

*** set_union

*** set_intersection

*** set_difference

*** set_symmetric_difference

** heap 相关算法

*** make_heap

*** pop_heap

*** push_heap

*** sort_heap

** 其他算法
*** adjacent_find

找到第一组满足条件的相邻元素。
#+BEGIN_SRC C++
  template<class ForwardIterator>
  ForwardIterator adjacent_find(ForwardIterator first, ForwardIterator last)
  {
      if (first == last)
          return last;
      ForwardIterator next = first;
      while (++next != last) {
          if(*first == *next) return first;
          first = next;
      }
      return last;
  }
  template<class ForwardIterator>
  ForwardIterator adjacent_find(ForwardIterator first, ForwardIterator last
                                BinaryPredicate binary_op)
  {
      if (first == last)
          return last;
      ForwardIterator next = first;
      while (++next != last) {
          if(binary_op(*first, *next)) return first;
          first = next;
      }
      return last;
  }
#+END_SRC
*** count

运用equality操作符，将[first, last)区间内的每一个元素拿来和指定值value比较，并返回与value相等的元素个数。
#+BEGIN_SRC C++
  template<class InputIterator, class T>
  typename iterator_traits<InputIterator>::difference_type
  count(InputIterator first, InputIterator last, const T& value)
  {
      typename iterator_traits<InputIterator>::difference_type n = 0;
      for(; first != last; ++first)
          if(*first == value) ++n;
      return n;
  }
#+END_SRC
*** count_if

将制定操作（一个仿函数）pred实施于[first, last)区间内的每一个元素身上，并将“造成pred之计算结果为true”的所有元素的个数返回。
#+BEGIN_SRC C++
  template<class InputIterator, class Predicate>
  typename iterator_traits<InputIterator>::difference_type
  count_if(InputIterator first, InputIterator last, Predicate pred)
  {
      typename iterator_traits<InputIterator>::difference_type n = 0;
      for(; first != last; ++first)
          if(pred(*first)) ++n;
      return n;
  }
#+END_SRC
*** find 参照 count

#+BEGIN_SRC C++
  template<class InputIterator, class T>
  InputIterator find(InputIterator first, InputIterator last, const T& value);
#+END_SRC
