cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18"><span class="section-number-4">1.2.11</span> copy<sub>backward</sub> &#x2013; 参照 copy</h4>
<div class="outline-text-4" id="text-1-2-11">
<p>
将[first,last)区间内的每一个元素，以逆行的方向复制到以result-1为起点，方向亦为逆行的区间上。
</p>

<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BidirectionalIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BidirectionalIterator2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">BidirectionalIterator2</span> <span style="color: #0000ff; font-weight: bold;">copy</span><span style="color: #707183;">(</span> <span style="color: #00ff00;">BidirectionalIterator1</span> <span style="color: #ffff00;">first</span>,
                                    <span style="color: #00ff00;">BidirectionalIterator1</span> <span style="color: #ffff00;">last</span>,
                                    <span style="color: #00ff00;">BidirectionalIterator2</span> <span style="color: #ffff00;">result</span><span style="color: #707183;">)</span>;
</pre>
</div>
<p>
copy<sub>backward</sub> 所接受的迭代器必须是BidirectionalTterators, 才能够“倒行逆施”。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">1.3</span> set 相关算法</h3>
<div class="outline-text-3" id="text-1-3">
<p>
STL一共提供了四种与set（集合）相关的算法，分别是并集（union）、交集（intersection）、差集（difference）、对称差集（symmetric difference）。
</p>
</div>

<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">1.3.1</span> set<sub>union</sub></h4>
</div>

<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">1.3.2</span> set<sub>intersection</sub></h4>
</div>

<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">1.3.3</span> set<sub>difference</sub></h4>
</div>

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">1.3.4</span> set<sub>symmetric</sub><sub>difference</sub></h4>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">1.4</span> heap 相关算法</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">1.4.1</span> make<sub>heap</sub></h4>
</div>

<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">1.4.2</span> pop<sub>heap</sub></h4>
</div>

<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">1.4.3</span> push<sub>heap</sub></h4>
</div>

<div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">1.4.4</span> sort<sub>heap</sub></h4>
</div>
</div>

<div id="outline-container-orgheadline63" class="outline-3">
<h3 id="orgheadline63"><span class="section-number-3">1.5</span> 其他算法</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">1.5.1</span> adjacent<sub>find</sub></h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
找到第一组满足条件的相邻元素。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">ForwardIterator</span> <span style="color: #0000ff; font-weight: bold;">adjacent_find</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span>first == last<span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">return</span> last;
    <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">next</span> = first;
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>++next != last<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>*first == *next<span style="color: #909183;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> first;
        first = next;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> last;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">ForwardIterator</span> <span style="color: #0000ff; font-weight: bold;">adjacent_find</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> last
                              <span style="color: #00ff00;">BinaryPredicate</span> <span style="color: #ffff00;">binary_op</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span>first == last<span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">return</span> last;
    <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">next</span> = first;
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>++next != last<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>binary_op<span style="color: #709870;">(</span>*first, *next<span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> first;
        first = next;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> last;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline31" class="outline-4">
<h4 id="orgheadline31"><span class="section-number-4">1.5.2</span> count</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
运用equality操作符，将[first, last)区间内的每一个元素拿来和指定值value比较，并返回与value相等的元素个数。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">typename</span> <span style="color: #ff00ff;">iterator_traits</span><span style="color: #707183;">&lt;</span><span style="color: #00ff00;">InputIterator</span><span style="color: #707183;">&gt;</span>::<span style="color: #00ff00;">difference_type</span>
<span style="color: #0000ff; font-weight: bold;">count</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">value</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">typename</span> <span style="color: #ff00ff;">iterator_traits</span><span style="color: #7388d6;">&lt;</span><span style="color: #00ff00;">InputIterator</span><span style="color: #7388d6;">&gt;</span>::<span style="color: #00ff00;">difference_type</span> <span style="color: #ffff00;">n</span> = <span style="color: #ff00ff;">0</span>;
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first != last; ++first<span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>*first == value<span style="color: #7388d6;">)</span> ++n;
    <span style="color: #00ffff; font-weight: bold;">return</span> n;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-4">
<h4 id="orgheadline32"><span class="section-number-4">1.5.3</span> count<sub>if</sub></h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
将制定操作（一个仿函数）pred实施于[first, last)区间内的每一个元素身上，并将“造成pred之计算结果为true”的所有元素的个数返回。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Predicate</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">typename</span> <span style="color: #ff00ff;">iterator_traits</span><span style="color: #707183;">&lt;</span><span style="color: #00ff00;">InputIterator</span><span style="color: #707183;">&gt;</span>::<span style="color: #00ff00;">difference_type</span>
<span style="color: #0000ff; font-weight: bold;">count_if</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">Predicate</span> <span style="color: #ffff00;">pred</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">typename</span> <span style="color: #ff00ff;">iterator_traits</span><span style="color: #7388d6;">&lt;</span><span style="color: #00ff00;">InputIterator</span><span style="color: #7388d6;">&gt;</span>::<span style="color: #00ff00;">difference_type</span> <span style="color: #ffff00;">n</span> = <span style="color: #ff00ff;">0</span>;
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first != last; ++first<span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>pred<span style="color: #909183;">(</span>*first<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> ++n;
    <span style="color: #00ffff; font-weight: bold;">return</span> n;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
