cplusplus/STL-algorithms.org
*** find_end

在序列一[first1, last1)所涵盖的区间中，查找序列二[first2, last2)的最后一次出现点。

#+BEGIN_SRC C++
  template<class ForwardIterator1, class ForwardIterator2>
  inline ForwardIterator1
  find_end(ForwardIterator1 first1, ForwardIterator1 last1,
           ForwardIterator2 first2, ForwardIterator2 last2)
  {
      typedef typename iterator_traits<ForwardIterator1>::iterator_category category1;
      typedef typename iterator_traits<ForwardIterator2>::iterator_category category2;
      return __find_end(first1, last1, first2, last2, category1(), category2());
  }
  template<class ForwardIterator1, class ForwardIterator2>
  ForwardIterator1 __find_end(ForwardIterator1 first1, ForwardIterator1 last1,
                              ForwardIterator2 first2, ForwardIterator2 last2,
                              forward_iterator_tag, forward_iterator_tag)
  {
      if(first2 == last2) return last1;
      else {
          ForwardIterator1 result = last1;
          while (1) {
              //先搜索下一组，再把下一组赋给result  就和单链表删除节点一样，要删除下一个节点，
              //我们要预留上一个节点，这里是要先找到 下一个不符合的情况 我们才知道这是最后一个
              ForwardIterator1 new_result = search(first1, last1, first2, last2);
              if(new_result == last1) return result;
              else {
                  result = new_result;
                  first1 = new_result;
                  ++first;
              }
          }
      }
  }
  //双向迭代器走这边
  template<class BidirectionalIterator1, class BidirectionalIterator2>
  BidirectionalIterator1
  __find_end(BidirectionalIterator1 first1, BidirectionalIterator1 last1,
             BidirectionalIterator2 first2, BidirectionalIterator2 last2,
             bidirectional_iterator_tag, bidirectional_iterator_tag)
  {
      typedef reverse_iterator<BidirectionalIterator1> reviter1;
      typedef reverse_iterator<BidirectionalIterator2> reviter2;
      //先确定end位置
      reviter1 rlast1(first1);
      reviter2 rlast2(first2);
      //找到第一组就可以了
      reviter1 rresult = search(reviter1(last1), rlast1, reviter2(last2), rlast2);
      if(rresult == rlast1) return last1;       //没找到
      else {
          //修改位置， base()成员函数可以取得真实位置，因为反向迭代器有两个位置，
          //一个是真实位置，一个是他 “下一个”位置 他的”下一个“其实是正向迭代器的上一个
          //1 2 3 此时反向迭代器指向3 operator*() 取到的是2 base()取到的是 3
          //下面的操作是为了使result == end
          BidirectionalIterator1 result = rresult.base();
          //减去距离，就可以使result变成first
          advance(result, -distance(first2, last2));
          return result;
      }
  }
#+END_SRC
