cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline35" class="outline-4">
<h4 id="orgheadline35"><span class="section-number-4">1.5.6</span> find<sub>end</sub></h4>
<div class="outline-text-4" id="text-1-5-6">
<p>
在序列一[first1, last1)所涵盖的区间中，查找序列二[first2, last2)的最后一次出现点。
</p>

<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">ForwardIterator1</span>
<span style="color: #0000ff; font-weight: bold;">find_end</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">last1</span>,
         <span style="color: #00ff00;">ForwardIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">ForwardIterator2</span> <span style="color: #ffff00;">last2</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">typedef</span> <span style="color: #00ffff; font-weight: bold;">typename</span> <span style="color: #ff00ff;">iterator_traits</span><span style="color: #7388d6;">&lt;</span><span style="color: #00ff00;">ForwardIterator1</span><span style="color: #7388d6;">&gt;</span>::<span style="color: #00ff00;">iterator_category</span> <span style="color: #00ff00;">category1</span>;
    <span style="color: #00ffff; font-weight: bold;">typedef</span> <span style="color: #00ffff; font-weight: bold;">typename</span> <span style="color: #ff00ff;">iterator_traits</span><span style="color: #7388d6;">&lt;</span><span style="color: #00ff00;">ForwardIterator2</span><span style="color: #7388d6;">&gt;</span>::<span style="color: #00ff00;">iterator_category</span> <span style="color: #00ff00;">category2</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> __find_end<span style="color: #7388d6;">(</span>first1, last1, first2, last2, category1<span style="color: #909183;">()</span>, category2<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #0000ff; font-weight: bold;">__find_end</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">last1</span>,
                            <span style="color: #00ff00;">ForwardIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">ForwardIterator2</span> <span style="color: #ffff00;">last2</span>,
                            forward_iterator_tag, forward_iterator_tag<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>first2 == last2<span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> last1;
    <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">result</span> = last1;
        <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #909183;">(</span><span style="color: #ff00ff;">1</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#20808;&#25628;&#32034;&#19979;&#19968;&#32452;&#65292;&#20877;&#25226;&#19979;&#19968;&#32452;&#36171;&#32473;result  &#23601;&#21644;&#21333;&#38142;&#34920;&#21024;&#38500;&#33410;&#28857;&#19968;&#26679;&#65292;&#35201;&#21024;&#38500;&#19979;&#19968;&#20010;&#33410;&#28857;&#65292;</span>
            <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#25105;&#20204;&#35201;&#39044;&#30041;&#19978;&#19968;&#20010;&#33410;&#28857;&#65292;&#36825;&#37324;&#26159;&#35201;&#20808;&#25214;&#21040; &#19979;&#19968;&#20010;&#19981;&#31526;&#21512;&#30340;&#24773;&#20917; &#25105;&#20204;&#25165;&#30693;&#36947;&#36825;&#26159;&#26368;&#21518;&#19968;&#20010;</span>
            <span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">new_result</span> = search<span style="color: #709870;">(</span>first1, last1, first2, last2<span style="color: #709870;">)</span>;
            <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #709870;">(</span>new_result == last1<span style="color: #709870;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> result;
            <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #709870;">{</span>
                result = new_result;
                first1 = new_result;
                ++first;
            <span style="color: #709870;">}</span>
        <span style="color: #909183;">}</span>
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
<span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#21452;&#21521;&#36845;&#20195;&#22120;&#36208;&#36825;&#36793;</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BidirectionalIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BidirectionalIterator2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">BidirectionalIterator1</span>
<span style="color: #0000ff; font-weight: bold;">__find_end</span><span style="color: #707183;">(</span><span style="color: #00ff00;">BidirectionalIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">BidirectionalIterator1</span> <span style="color: #ffff00;">last1</span>,
           <span style="color: #00ff00;">BidirectionalIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">BidirectionalIterator2</span> <span style="color: #ffff00;">last2</span>,
           bidirectional_iterator_tag, bidirectional_iterator_tag<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">typedef</span> <span style="color: #00ff00;">reverse_iterator</span><span style="color: #7388d6;">&lt;</span><span style="color: #00ff00;">BidirectionalIterator1</span><span style="color: #7388d6;">&gt;</span> <span style="color: #00ff00;">reviter1</span>;
    <span style="color: #00ffff; font-weight: bold;">typedef</span> <span style="color: #00ff00;">reverse_iterator</span><span style="color: #7388d6;">&lt;</span><span style="color: #00ff00;">BidirectionalIterator2</span><span style="color: #7388d6;">&gt;</span> <span style="color: #00ff00;">reviter2</span>;
    <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#20808;&#30830;&#23450;end&#20301;&#32622;</span>
    <span style="color: #00ff00;">reviter1</span> <span style="color: #ffff00;">rlast1</span><span style="color: #7388d6;">(</span>first1<span style="color: #7388d6;">)</span>;
    <span style="color: #00ff00;">reviter2</span> <span style="color: #ffff00;">rlast2</span><span style="color: #7388d6;">(</span>first2<span style="color: #7388d6;">)</span>;
    <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#25214;&#21040;&#31532;&#19968;&#32452;&#23601;&#21487;&#20197;&#20102;</span>
    <span style="color: #00ff00;">reviter1</span> <span style="color: #ffff00;">rresult</span> = search<span style="color: #7388d6;">(</span>reviter1<span style="color: #909183;">(</span>last1<span style="color: #909183;">)</span>, rlast1, reviter2<span style="color: #909183;">(</span>last2<span style="color: #909183;">)</span>, rlast2<span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>rresult == rlast1<span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> last1;       <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#27809;&#25214;&#21040;</span>
    <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #7388d6;">{</span>
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#20462;&#25913;&#20301;&#32622;&#65292; base()&#25104;&#21592;&#20989;&#25968;&#21487;&#20197;&#21462;&#24471;&#30495;&#23454;&#20301;&#32622;&#65292;&#22240;&#20026;&#21453;&#21521;&#36845;&#20195;&#22120;&#26377;&#20004;&#20010;&#20301;&#32622;&#65292;</span>
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#19968;&#20010;&#26159;&#30495;&#23454;&#20301;&#32622;&#65292;&#19968;&#20010;&#26159;&#20182; &#8220;&#19979;&#19968;&#20010;&#8221;&#20301;&#32622; &#20182;&#30340;&#8221;&#19979;&#19968;&#20010;&#8220;&#20854;&#23454;&#26159;&#27491;&#21521;&#36845;&#20195;&#22120;&#30340;&#19978;&#19968;&#20010;</span>
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">1 2 3 &#27492;&#26102;&#21453;&#21521;&#36845;&#20195;&#22120;&#25351;&#21521;3 operator*() &#21462;&#21040;&#30340;&#26159;2 base()&#21462;&#21040;&#30340;&#26159; 3</span>
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#19979;&#38754;&#30340;&#25805;&#20316;&#26159;&#20026;&#20102;&#20351;result == end</span>
        <span style="color: #00ff00;">BidirectionalIterator1</span> <span style="color: #ffff00;">result</span> = rresult.base<span style="color: #909183;">()</span>;
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#20943;&#21435;&#36317;&#31163;&#65292;&#23601;&#21487;&#20197;&#20351;result&#21464;&#25104;first</span>
        advance<span style="color: #909183;">(</span>result, -distance<span style="color: #709870;">(</span>first2, last2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>;
        <span style="color: #00ffff; font-weight: bold;">return</span> result;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
