cplusplus/STL-algorithms.org
*** find_first_of 参照 find_end

在序列一[first1, last1)所涵盖的区间中，查找序列二[first2, last2)的第一次出现点。
#+BEGIN_SRC C++
  template<class InputIterator, class ForwardIterator>
  InputIterator find_first_of(InputIterator first1, InputIterator last1,
                              ForwardIterator first2, ForwardIterator last2)
  {
      for(; first1 != last1; ++first1)
          for(ForwardIterator iter = first2; iter != last2; ++iter)
              if(*first1 == *iter) return first;
      return last1;
  }
  template<class InputIterator, class ForwardIterator, class BinaryPredicate>
  InputIterator find_first_of(InputIterator first1, InputIterator last1,
                              ForwardIterator first2, ForwardIterator last2
                              BinaryPredicate comp)
  {
      for(; first1 != last1; ++first1)
          for(ForwardIterator iter = first2; iter != last2; ++iter)
              if(comp(*first1 == *iter)) return first;
      return last1;
  }
#+END_SRC
*** for_each

将仿函数f施行于[first1, last1)区间内的每一个元素身上。
#+BEGIN_SRC C++
  template<class InputIterator, class Function>
  Function for_each(InputIterator first, InputIterator last, Function f)
  {
      for(; first != last; ++first) f(*first);
      return f;
  }
#+END_SRC
*** generate

将仿函数gen的运算结果填写在[first, last)区间内的所有元素身上。
#+BEGIN_SRC C++
  template<class ForwardIterator, class Generator>
  void generate(ForwardIterator first, ForwardIterator last, Generator gen)
  {
      for(; first != last; ++first)
          ,*first = gen();
  }
#+END_SRC
*** generate_n
    
将仿函数gen的运算结果填写在[first, first + n)区间内的所有元素身上。

#+BEGIN_SRC C++
  template<class OutputIterator,class Size, class Generator>
  OutputIterator generate_n(OutputIterator first, Size n, Generator gen)
  {
      for(; n > 0; --n, ++first) *first = gen();
      return first;
  }
#+END_SRC
