cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36"><span class="section-number-4">1.5.7</span> find<sub>first</sub><sub>of</sub> 参照 find<sub>end</sub></h4>
<div class="outline-text-4" id="text-1-5-7">
<p>
在序列一[first1, last1)所涵盖的区间中，查找序列二[first2, last2)的第一次出现点。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">InputIterator</span> <span style="color: #0000ff; font-weight: bold;">find_first_of</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last1</span>,
                            <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last2</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first1 != last1; ++first1<span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">iter</span> = first2; iter != last2; ++iter<span style="color: #7388d6;">)</span>
            <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>*first1 == *iter<span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> first;
    <span style="color: #00ffff; font-weight: bold;">return</span> last1;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BinaryPredicate</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">InputIterator</span> <span style="color: #0000ff; font-weight: bold;">find_first_of</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last1</span>,
                            <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">ForwardIterator</span> last2
                            <span style="color: #00ff00;">BinaryPredicate</span> <span style="color: #ffff00;">comp</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first1 != last1; ++first1<span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">iter</span> = first2; iter != last2; ++iter<span style="color: #7388d6;">)</span>
            <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>comp<span style="color: #909183;">(</span>*first1 == *iter<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> first;
    <span style="color: #00ffff; font-weight: bold;">return</span> last1;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline37" class="outline-4">
<h4 id="orgheadline37"><span class="section-number-4">1.5.8</span> for<sub>each</sub></h4>
<div class="outline-text-4" id="text-1-5-8">
<p>
将仿函数f施行于[first1, last1)区间内的每一个元素身上。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Function</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">Function</span> <span style="color: #0000ff; font-weight: bold;">for_each</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">Function</span> <span style="color: #ffff00;">f</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first != last; ++first<span style="color: #7388d6;">)</span> f<span style="color: #7388d6;">(</span>*first<span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> f;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline38" class="outline-4">
<h4 id="orgheadline38"><span class="section-number-4">1.5.9</span> generate</h4>
<div class="outline-text-4" id="text-1-5-9">
<p>
将仿函数gen的运算结果填写在[first, last)区间内的所有元素身上。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Generator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">generate</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">Generator</span> <span style="color: #ffff00;">gen</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first != last; ++first<span style="color: #7388d6;">)</span>
        *first = gen<span style="color: #7388d6;">()</span>;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="section-number-4">1.5.10</span> generate<sub>n</sub></h4>
<div class="outline-text-4" id="text-1-5-10">
<p>
将仿函数gen的运算结果填写在[first, first + n)区间内的所有元素身上。
</p>

<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>,<span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Size</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Generator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">generate_n</span><span style="color: #707183;">(</span><span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">Size</span> <span style="color: #ffff00;">n</span>, <span style="color: #00ff00;">Generator</span> <span style="color: #ffff00;">gen</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; n &gt; <span style="color: #ff00ff;">0</span>; --n, ++first<span style="color: #7388d6;">)</span> *first = gen<span style="color: #7388d6;">()</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> first;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
