cplusplus/STL-algorithms.org
*** includes (应用于有序区间)

判断序列二是否“涵盖于”序列一。
#+BEGIN_SRC C++
  template<class InputIterator1, class InputIterator2>
  bool includes(InputIterator1 first1, InputIterator1 last1,
                InputIterator2 first2, InputIterator2 last2)
  {
      while (first1 != last1 && first2 != last2) {
          if(*first2 < *first1) return false;
          else if(*first1 < *first2) ++first1;
          else ++first1, ++first2;
      }
      return first2 == last2;
  }

  template<class InputIterator1, class InputIterator2, class Compare>
  bool includes(InputIterator1 first1, InputIterator1 last1,
                InputIterator2 first2, InputIterator2 last2, Compare comp)
  {
      while (first1 != last1 && first2 != last2) {
          if(compare(*first2, *first1)) return false;
          else if(compare(*first1, *first2)) ++first1;
          else ++first1, ++first2;
      }
      return first2 == last2;
  }
#+END_SRC
*** max_element

返回一个迭代器，指向序列之中数值最大的元素。
#+BEGIN_SRC C++
  template<class ForwardIterator>
  ForwardIterator max_element(ForwardIterator first, ForwardIterator last)
  {
      if(first == last) return first;
      ForwardIterator result = first;
      while(++first != last)
          if(*result < *first) result = first;
      return result;
  }
  template<class ForwardIterator, class Compare>
  ForwardIterator max_element(ForwardIterator first, ForwardIterator last,
                              Compare comp)
  {
      if(first == last) return first;
      ForwardIterator result = first;
      while(++first != last)
          if(comp(*result, *first)) result = first;
      return result;
  }
#+END_SRC
*** min_element -- 参照 max_element

返回一个迭代器，指向序列之中数值最小的元素。

