cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline40" class="outline-4">
<h4 id="orgheadline40"><span class="section-number-4">1.5.11</span> includes (应用于有序区间)</h4>
<div class="outline-text-4" id="text-1-5-11">
<p>
判断序列二是否“涵盖于”序列一。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">bool</span> <span style="color: #0000ff; font-weight: bold;">includes</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">last1</span>,
              <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">last2</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>first1 != last1 &amp;&amp; first2 != last2<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>*first2 &lt; *first1<span style="color: #909183;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #ff00ff;">false</span>;
        <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>*first1 &lt; *first2<span style="color: #909183;">)</span> ++first1;
        <span style="color: #00ffff; font-weight: bold;">else</span> ++first1, ++first2;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> first2 == last2;
<span style="color: #707183;">}</span>

<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Compare</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">bool</span> <span style="color: #0000ff; font-weight: bold;">includes</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">last1</span>,
              <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">last2</span>, <span style="color: #00ff00;">Compare</span> <span style="color: #ffff00;">comp</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>first1 != last1 &amp;&amp; first2 != last2<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>compare<span style="color: #709870;">(</span>*first2, *first1<span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #ff00ff;">false</span>;
        <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>compare<span style="color: #709870;">(</span>*first1, *first2<span style="color: #709870;">)</span><span style="color: #909183;">)</span> ++first1;
        <span style="color: #00ffff; font-weight: bold;">else</span> ++first1, ++first2;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> first2 == last2;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline41" class="outline-4">
<h4 id="orgheadline41"><span class="section-number-4">1.5.12</span> max<sub>element</sub></h4>
<div class="outline-text-4" id="text-1-5-12">
<p>
返回一个迭代器，指向序列之中数值最大的元素。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">ForwardIterator</span> <span style="color: #0000ff; font-weight: bold;">max_element</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>first == last<span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> first;
    <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">result</span> = first;
    <span style="color: #00ffff; font-weight: bold;">while</span><span style="color: #7388d6;">(</span>++first != last<span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>*result &lt; *first<span style="color: #7388d6;">)</span> result = first;
    <span style="color: #00ffff; font-weight: bold;">return</span> result;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Compare</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">ForwardIterator</span> <span style="color: #0000ff; font-weight: bold;">max_element</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span>,
                            <span style="color: #00ff00;">Compare</span> <span style="color: #ffff00;">comp</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>first == last<span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> first;
    <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">result</span> = first;
    <span style="color: #00ffff; font-weight: bold;">while</span><span style="color: #7388d6;">(</span>++first != last<span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>comp<span style="color: #909183;">(</span>*result, *first<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> result = first;
    <span style="color: #00ffff; font-weight: bold;">return</span> result;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline42" class="outline-4">
<h4 id="orgheadline42"><span class="section-number-4">1.5.13</span> min<sub>element</sub> &#x2013; 参照 max<sub>element</sub></h4>
<div class="outline-text-4" id="text-1-5-13">
<p>
返回一个迭代器，指向序列之中数值最小的元素。
</p>
</div>
</div>
