cplusplus/STL-algorithms.org
*** merge (应用于有序空间)

将两个序列合并为一个序列
#+BEGIN_SRC C++
  template<class InputIterator1, class InputIterator2, class OutputIterator>
  OutputIterator merge(InputIterator1 first1, InputIterator1 last1,
                       InputIterator2 first2, InputIterator2 last2,
                       OutputIterator result)
  {
      while (first1 != last1 && first2 != last2) {
          if(*first2 < *first1) {
              ,*result = *first2;
              ++first2;
          }
          else {
              ,*result = *first1;
              ++first1;
          }
          ++result;
      }
      return copy(first2, last2, copy(first1, last1, result));
  }
  template<class InputIterator1, class InputIterator2, class OutputIterator, class Compare>
  OutputIterator merge(InputIterator1 first1, InputIterator1 last1,
                       InputIterator2 first2, InputIterator2 last2,
                       OutputIterator result, Compare comp)
  {
      while (first1 != last1 && first2 != last2) {
          if(comp(*first2, *first1)) {
              ,*result = *first2;
              ++first2;
          }
          else {
              ,*result = *first1;
              ++first1;
          }
          ++result;
      }
      return copy(first2, last2, copy(first1, last1, result));
  }
#+END_SRC
*** partition

将区间[first, last)中的元素重新排列，所有被一元条件运算pred判定为true的元素，都会被放在区间的前端，被判定为false的元素，都会被放在区间的后端。这个算法并不保证保留元素的原始相对位置。如果需要保留原始相对位置，应使用stable_partition。
#+BEGIN_SRC C++
  template<class BidirectionalIterator, class Predicate>
  BidirectionalIterator partition(BidirectionalIterator first,
                                  BidirectionalIterator last,
                                  Predicate pred)
  {
      while (true) {
          while (true) {
              if(first == last) return first;
              else if(pred(*first)) ++first;
              else break;
          } --last;             //第一次指向的事end所以-- 之后指向的是判断过的数，所以要--
          while (true) {
              if(first == last) return first;
              else if(!pred(*last)) --last;
              else break;
          }
          iter_swap(first, last);
          ++first;            //接下来要判断下一个
      }
  }
#+END_SRC
*** remove 移除（但不删除）

移除[first, last)区间内所有与value相等的元素。
注意：这一算法并不是真正从容器中删除那些元素（换句话说容器的大小并没有发生改变）。
#+BEGIN_SRC C++
  template<class ForwardIterator, class T>
  ForwardIterator remove(ForwardIterator first, ForwardIterator last,
                         const T& value)
  {
      first = find(first, last, value);
      ForwardIterator next = first;
      return first == last ? first : remove_copy(++next, last, first, value);
  }
#+END_SRC
