cplusplus/STL-algorithms.html

<div id="outline-container-orgheadline43" class="outline-4">
<h4 id="orgheadline43"><span class="section-number-4">1.5.14</span> merge (应用于有序空间)</h4>
<div class="outline-text-4" id="text-1-5-14">
<p>
将两个序列合并为一个序列
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">merge</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">last1</span>,
                     <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">last2</span>,
                     <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>first1 != last1 &amp;&amp; first2 != last2<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>*first2 &lt; *first1<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            *result = *first2;
            ++first2;
        <span style="color: #909183;">}</span>
        <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #909183;">{</span>
            *result = *first1;
            ++first1;
        <span style="color: #909183;">}</span>
        ++result;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> copy<span style="color: #7388d6;">(</span>first2, last2, copy<span style="color: #909183;">(</span>first1, last1, result<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Compare</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">merge</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">last1</span>,
                     <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">last2</span>,
                     <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, <span style="color: #00ff00;">Compare</span> <span style="color: #ffff00;">comp</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>first1 != last1 &amp;&amp; first2 != last2<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>comp<span style="color: #709870;">(</span>*first2, *first1<span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            *result = *first2;
            ++first2;
        <span style="color: #909183;">}</span>
        <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #909183;">{</span>
            *result = *first1;
            ++first1;
        <span style="color: #909183;">}</span>
        ++result;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> copy<span style="color: #7388d6;">(</span>first2, last2, copy<span style="color: #909183;">(</span>first1, last1, result<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline44" class="outline-4">
<h4 id="orgheadline44"><span class="section-number-4">1.5.15</span> partition</h4>
<div class="outline-text-4" id="text-1-5-15">
<p>
将区间[first, last)中的元素重新排列，所有被一元条件运算pred判定为true的元素，都会被放在区间的前端，被判定为false的元素，都会被放在区间的后端。这个算法并不保证保留元素的原始相对位置。如果需要保留原始相对位置，应使用stable<sub>partition</sub>。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BidirectionalIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Predicate</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">BidirectionalIterator</span> <span style="color: #0000ff; font-weight: bold;">partition</span><span style="color: #707183;">(</span><span style="color: #00ff00;">BidirectionalIterator</span> <span style="color: #ffff00;">first</span>,
                                <span style="color: #00ff00;">BidirectionalIterator</span> <span style="color: #ffff00;">last</span>,
                                <span style="color: #00ff00;">Predicate</span> <span style="color: #ffff00;">pred</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span><span style="color: #ff00ff;">true</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #909183;">(</span><span style="color: #ff00ff;">true</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #709870;">(</span>first == last<span style="color: #709870;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> first;
            <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #709870;">(</span>pred<span style="color: #907373;">(</span>*first<span style="color: #907373;">)</span><span style="color: #709870;">)</span> ++first;
            <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #00ffff; font-weight: bold;">break</span>;
        <span style="color: #909183;">}</span> --last;             <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#31532;&#19968;&#27425;&#25351;&#21521;&#30340;&#20107;end&#25152;&#20197;-- &#20043;&#21518;&#25351;&#21521;&#30340;&#26159;&#21028;&#26029;&#36807;&#30340;&#25968;&#65292;&#25152;&#20197;&#35201;--</span>
        <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #909183;">(</span><span style="color: #ff00ff;">true</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #709870;">(</span>first == last<span style="color: #709870;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> first;
            <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #709870;">(</span>!pred<span style="color: #907373;">(</span>*last<span style="color: #907373;">)</span><span style="color: #709870;">)</span> --last;
            <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #00ffff; font-weight: bold;">break</span>;
        <span style="color: #909183;">}</span>
        iter_swap<span style="color: #909183;">(</span>first, last<span style="color: #909183;">)</span>;
        ++first;            <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#25509;&#19979;&#26469;&#35201;&#21028;&#26029;&#19979;&#19968;&#20010;</span>
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline45" class="outline-4">
<h4 id="orgheadline45"><span class="section-number-4">1.5.16</span> remove 移除（但不删除）</h4>
<div class="outline-text-4" id="text-1-5-16">
<p>
移除[first, last)区间内所有与value相等的元素。
注意：这一算法并不是真正从容器中删除那些元素（换句话说容器的大小并没有发生改变）。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">ForwardIterator</span> <span style="color: #0000ff; font-weight: bold;">remove</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span>,
                       <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">value</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    first = find<span style="color: #7388d6;">(</span>first, last, value<span style="color: #7388d6;">)</span>;
    <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">next</span> = first;
    <span style="color: #00ffff; font-weight: bold;">return</span> first == last ? first : remove_copy<span style="color: #7388d6;">(</span>++next, last, first, value<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
