cplusplus/STL-algorithms.org
*** remove_copy

移除[first, last)区间内所有与value相等的元素。（原容器不发生改变）将结果复制到一个以result表示起始位置的容器身上。
#+BEGIN_SRC C++
  template<class InputIterator, class OutputIterator, class T>
  OutputIterator remove_copy(InputIterator, first, InputIterator last,
                             OutputIterator result, const T& value)
  {
      for(; first != last; ++first)
          if(*first != value) {
              ,*result = *first;
              ++result;
          }
      return result;
  }
#+END_SRC
*** remove_if -- 参照 remove

*** remove_copy_if -- 参照 remove_copy

*** replace

将[first, last)区间内的所有old_value都以new_value取代。
#+BEGIN_SRC C++
  template<class ForwardIterator, class T>
  void replace(ForwardIterator first, ForwardIterator last,
               const T& old_value, const T& new_value)
  {
      for(; first != last; ++first)
          if(*first == old_value)
              ,*first = new_value;
  }
#+END_SRC
*** replace_copy

将[first, last)区间内的所有old_value都以new_value取代。（原容器不发生改变）将结果复制到一个以result表示起始位置的容器身上。
#+BEGIN_SRC C++
  template<class InputIterator, class OutputIterator, class T>
  OutputIterator replace_copy(InputIterator first, InputIterator last,
                              OutputIterator result, const T& old_value,
                              const T& new_value)
  {
      for(; first != last; ++first, ++result)
          ,*result = *first == old_value ? new_value : *first;
      return result;
  }
#+END_SRC
*** replace_if -- 参照 replace

*** replace_copy_if -- 参照 replace_copy
    
*** reverse

将序列[first, last)区间的元素在原容器中颠倒重排。
#+BEGIN_SRC C++
  template<class BidirectionalIterator>
  inline void reverse(BidirectionalIterator first, BidirectionalIterator last)
  {
      __reverse(first, last, iterator_category(first));
  }
  template<class BidirectionalIterator>
  void __reverse(BidirectionalIterator first, BidirectionalIterator last,
                 bidirectional_iterator_tag)
  {
      while (true) {
          if(first == last || first == --last) return;
          else iter_swap(first++, last);
      }
  }
  //随机迭代器的版本只需要判断一次 而非随机迭代器要判断两次，故效率上有差距，所以分开写
  template<class RandomAccessIterator>
  void __reverse(RandomAccessIterator first, RandomAccessIterator last,
                 random_access_iterator_tag)
  {
      while(first < last)
          iter_swap(first++, --last);
  }
#+END_SRC

*** reverse_copy

#+BEGIN_SRC C++
  template<class BidirectionalIterator, class OutputIterator>
  OutputIterator reverse_copy(BidirectionalIterator first,
                              BidirectionalIterator last,
                              OutputIterator result)
  {
      while (first != last) {
          --last;
          ,*result = *last;
          ++result;
      }
      return result;
  }
#+END_SRC

