cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline46" class="outline-4">
<h4 id="orgheadline46"><span class="section-number-4">1.5.17</span> remove<sub>copy</sub></h4>
<div class="outline-text-4" id="text-1-5-17">
<p>
移除[first, last)区间内所有与value相等的元素。（原容器不发生改变）将结果复制到一个以result表示起始位置的容器身上。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">remove_copy</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span>, first, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                           <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">value</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first != last; ++first<span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>*first != value<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
            *result = *first;
            ++result;
        <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> result;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline47" class="outline-4">
<h4 id="orgheadline47"><span class="section-number-4">1.5.18</span> remove<sub>if</sub> &#x2013; 参照 remove</h4>
</div>

<div id="outline-container-orgheadline48" class="outline-4">
<h4 id="orgheadline48"><span class="section-number-4">1.5.19</span> remove<sub>copy</sub><sub>if</sub> &#x2013; 参照 remove<sub>copy</sub></h4>
</div>

<div id="outline-container-orgheadline49" class="outline-4">
<h4 id="orgheadline49"><span class="section-number-4">1.5.20</span> replace</h4>
<div class="outline-text-4" id="text-1-5-20">
<p>
将[first, last)区间内的所有old<sub>value都以new</sub><sub>value取代</sub>。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">replace</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span>,
             <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">old_value</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">new_value</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first != last; ++first<span style="color: #7388d6;">)</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>*first == old_value<span style="color: #7388d6;">)</span>
            *first = new_value;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline50" class="outline-4">
<h4 id="orgheadline50"><span class="section-number-4">1.5.21</span> replace<sub>copy</sub></h4>
<div class="outline-text-4" id="text-1-5-21">
<p>
将[first, last)区间内的所有old<sub>value都以new</sub><sub>value取代</sub>。（原容器不发生改变）将结果复制到一个以result表示起始位置的容器身上。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">replace_copy</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                            <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">old_value</span>,
                            <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">new_value</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first != last; ++first, ++result<span style="color: #7388d6;">)</span>
        *result = *first == old_value ? new_value : *first;
    <span style="color: #00ffff; font-weight: bold;">return</span> result;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline51" class="outline-4">
<h4 id="orgheadline51"><span class="section-number-4">1.5.22</span> replace<sub>if</sub> &#x2013; 参照 replace</h4>
</div>

<div id="outline-container-orgheadline52" class="outline-4">
<h4 id="orgheadline52"><span class="section-number-4">1.5.23</span> replace<sub>copy</sub><sub>if</sub> &#x2013; 参照 replace<sub>copy</sub></h4>
</div>

<div id="outline-container-orgheadline53" class="outline-4">
<h4 id="orgheadline53"><span class="section-number-4">1.5.24</span> reverse</h4>
<div class="outline-text-4" id="text-1-5-24">
<p>
将序列[first, last)区间的元素在原容器中颠倒重排。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BidirectionalIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">reverse</span><span style="color: #707183;">(</span><span style="color: #00ff00;">BidirectionalIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">BidirectionalIterator</span> <span style="color: #ffff00;">last</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    __reverse<span style="color: #7388d6;">(</span>first, last, iterator_category<span style="color: #909183;">(</span>first<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BidirectionalIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">__reverse</span><span style="color: #707183;">(</span><span style="color: #00ff00;">BidirectionalIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">BidirectionalIterator</span> <span style="color: #ffff00;">last</span>,
               bidirectional_iterator_tag<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span><span style="color: #ff00ff;">true</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>first == last || first == --last<span style="color: #909183;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span>;
        <span style="color: #00ffff; font-weight: bold;">else</span> iter_swap<span style="color: #909183;">(</span>first++, last<span style="color: #909183;">)</span>;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
<span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#38543;&#26426;&#36845;&#20195;&#22120;&#30340;&#29256;&#26412;&#21482;&#38656;&#35201;&#21028;&#26029;&#19968;&#27425; &#32780;&#38750;&#38543;&#26426;&#36845;&#20195;&#22120;&#35201;&#21028;&#26029;&#20004;&#27425;&#65292;&#25925;&#25928;&#29575;&#19978;&#26377;&#24046;&#36317;&#65292;&#25152;&#20197;&#20998;&#24320;&#20889;</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">RandomAccessIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">__reverse</span><span style="color: #707183;">(</span><span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">last</span>,
               random_access_iterator_tag<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span><span style="color: #7388d6;">(</span>first &lt; last<span style="color: #7388d6;">)</span>
        iter_swap<span style="color: #7388d6;">(</span>first++, --last<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
