cplusplus/STL-algorithms.org
*** rotate

将[first, middle)内的元素和[middle, last)内的元素互换。
#+BEGIN_SRC C++
  template<class ForwardIterator>
  inline void rotate(ForwardIterator first, ForwardIterator middle,
                     ForwardIterator last)
  {
      if(first == middle || middle == last) return;
      __rotate(first, middle, last, distance_type(first),
               iterator_category(first));
  }
  //单向的迭代器走这边
  //只能单向行走，效率最低，要赋值起码1.5n次(当两者区间相同时)。
  //调用一次swap就要赋值3次
  template<class ForwardIterator, class Distance>
  void __rotate(ForwardIterator first, ForwardIterator middle,
                ForwardIterator last, Distance*, forward_iterator_tag)
  {
      for(ForwardIterator i = middle; ;) {
          iter_swap(first, i);
          ++first;
          ++i;
          if(first == middle) {
              if(i == last) return;
              middle = i;
          }
          else if(i ==last) i = middle;
      }
  }
  //三次反转 固定赋值1.5n次
  template<class BidirectionalIterator, class Distance>
  void __rotate(BidirectionalIterator first, BidirectionalIterator middle,
                BidirectionalIterator last, Distance*,
                bidirectional_iterator_tag)
  {
      reverse(first, middle);
      reverse(middle, last);
      reverse(first, last);
  }
  template<class RandomAccessIterator, class Distance>
  void __rotate(RandomAccessIterator first, RandomAccessIterator middle,
                RandomAccessIterator last, Distance*,
                random_access_iterator_tag)
  {
      Distance n = __gcd(last - first, middle - first);
      while (n--)
          __rotate_cycle(first, last, first + n, middle - first,
                         value_type(first));
  }
  template<class EuclideanRingElement>
  EuclideanRingElement __gcd(EuclideanRingElement m, EuclideanRingElement n)
  {
      while (n != 0) {
          EuclideanRingElement t = m % n;
          m = n;
          n = t;
      }
      return m;
  }
  //最差的情况赋值1.5n次(当区间相等时)，最少赋值n＋1次(第一个或第二个区间为1时)。
  template<class RandomAccessIteratorm, class Distance, class T>
  void __rotate_cycle(RandomAccessIterator first, RandomAccessIterator last,
                      RandomAccessIterator initial, Distance shift, T*)
  {
      T value = *initial;
      RandomAccessIterator ptr1 = initial;
      RandomAccessIterator ptr2 = ptr1 + shift;
      while (ptr2 != initial) {
          ,*ptr1 = *ptr2;
          ptr1 = ptr2;
          if(last - ptr2 > shift)
              ptr2 += shift;
          else
              ptr2 = first + (shift - (last - ptr2));
      }
      ,*ptr1 = value;
  }
#+END_SRC
    
