cplusplus/STL-algorithms.html

<div id="outline-container-orgheadline54" class="outline-4">
<h4 id="orgheadline54"><span class="section-number-4">1.5.25</span> reverse<sub>copy</sub></h4>
<div class="outline-text-4" id="text-1-5-25">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BidirectionalIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">reverse_copy</span><span style="color: #707183;">(</span><span style="color: #00ff00;">BidirectionalIterator</span> <span style="color: #ffff00;">first</span>,
                            <span style="color: #00ff00;">BidirectionalIterator</span> <span style="color: #ffff00;">last</span>,
                            <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>first != last<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        --last;
        *result = *last;
        ++result;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> result;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline55" class="outline-4">
<h4 id="orgheadline55"><span class="section-number-4">1.5.26</span> rotate</h4>
<div class="outline-text-4" id="text-1-5-26">
<p>
将[first, middle)内的元素和[middle, last)内的元素互换。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">rotate</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">middle</span>,
                   <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>first == middle || middle == last<span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span>;
    __rotate<span style="color: #7388d6;">(</span>first, middle, last, distance_type<span style="color: #909183;">(</span>first<span style="color: #909183;">)</span>,
             iterator_category<span style="color: #909183;">(</span>first<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#21333;&#21521;&#30340;&#36845;&#20195;&#22120;&#36208;&#36825;&#36793;</span>
<span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#21482;&#33021;&#21333;&#21521;&#34892;&#36208;&#65292;&#25928;&#29575;&#26368;&#20302;&#65292;&#35201;&#36171;&#20540;&#36215;&#30721;1.5n&#27425;(&#24403;&#20004;&#32773;&#21306;&#38388;&#30456;&#21516;&#26102;)&#12290;</span>
<span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#35843;&#29992;&#19968;&#27425;swap&#23601;&#35201;&#36171;&#20540;3&#27425;</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Distance</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">__rotate</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">middle</span>,
              <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">Distance</span>*, forward_iterator_tag<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">i</span> = middle; ;<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        iter_swap<span style="color: #909183;">(</span>first, i<span style="color: #909183;">)</span>;
        ++first;
        ++i;
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>first == middle<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #709870;">(</span>i == last<span style="color: #709870;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span>;
            middle = i;
        <span style="color: #909183;">}</span>
        <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>i ==last<span style="color: #909183;">)</span> i = middle;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
<span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#19977;&#27425;&#21453;&#36716; &#22266;&#23450;&#36171;&#20540;1.5n&#27425;</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BidirectionalIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Distance</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">__rotate</span><span style="color: #707183;">(</span><span style="color: #00ff00;">BidirectionalIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">BidirectionalIterator</span> <span style="color: #ffff00;">middle</span>,
              <span style="color: #00ff00;">BidirectionalIterator</span> <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">Distance</span>*,
              bidirectional_iterator_tag<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    reverse<span style="color: #7388d6;">(</span>first, middle<span style="color: #7388d6;">)</span>;
    reverse<span style="color: #7388d6;">(</span>middle, last<span style="color: #7388d6;">)</span>;
    reverse<span style="color: #7388d6;">(</span>first, last<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">RandomAccessIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Distance</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">__rotate</span><span style="color: #707183;">(</span><span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">middle</span>,
              <span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">Distance</span>*,
              random_access_iterator_tag<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">Distance</span> <span style="color: #ffff00;">n</span> = __gcd<span style="color: #7388d6;">(</span>last - first, middle - first<span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>n--<span style="color: #7388d6;">)</span>
        __rotate_cycle<span style="color: #7388d6;">(</span>first, last, first + n, middle - first,
                       value_type<span style="color: #909183;">(</span>first<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">EuclideanRingElement</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">EuclideanRingElement</span> <span style="color: #0000ff; font-weight: bold;">__gcd</span><span style="color: #707183;">(</span><span style="color: #00ff00;">EuclideanRingElement</span> <span style="color: #ffff00;">m</span>, <span style="color: #00ff00;">EuclideanRingElement</span> <span style="color: #ffff00;">n</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>n != <span style="color: #ff00ff;">0</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ff00;">EuclideanRingElement</span> <span style="color: #ffff00;">t</span> = m % n;
        m = n;
        n = t;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> m;
<span style="color: #707183;">}</span>
<span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#26368;&#24046;&#30340;&#24773;&#20917;&#36171;&#20540;1.5n&#27425;(&#24403;&#21306;&#38388;&#30456;&#31561;&#26102;)&#65292;&#26368;&#23569;&#36171;&#20540;n&#65291;1&#27425;(&#31532;&#19968;&#20010;&#25110;&#31532;&#20108;&#20010;&#21306;&#38388;&#20026;1&#26102;)&#12290;</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">RandomAccessIteratorm</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Distance</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">__rotate_cycle</span><span style="color: #707183;">(</span><span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">last</span>,
                    <span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">initial</span>, <span style="color: #00ff00;">Distance</span> <span style="color: #ffff00;">shift</span>, <span style="color: #00ff00;">T</span>*<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">value</span> = *initial;
    <span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">ptr1</span> = initial;
    <span style="color: #00ff00;">RandomAccessIterator</span> <span style="color: #ffff00;">ptr2</span> = ptr1 + shift;
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>ptr2 != initial<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        *ptr1 = *ptr2;
        ptr1 = ptr2;
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>last - ptr2 &gt; shift<span style="color: #909183;">)</span>
            ptr2 += shift;
        <span style="color: #00ffff; font-weight: bold;">else</span>
            ptr2 = first + <span style="color: #909183;">(</span>shift - <span style="color: #709870;">(</span>last - ptr2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>;
    <span style="color: #7388d6;">}</span>
    *ptr1 = value;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
