cplusplus/STL-algorithms.org
*** rotate_copy

#+BEGIN_SRC C++
  template<class ForwardIterator, class OutputIterator>
  OutputIterator rotate_copy(ForwardIterator first, ForwardIterator middle,
                             ForwardIterator last, OutputIterator result)
  {
      return copy(first, middle, copy(middle, last, result));
  }
#+END_SRC
*** search

#+BEGIN_SRC C++
  template<class ForwardIterator1, class ForwardIterator2>
  inline ForwardIterator search(ForwardIterator1 first1,
                                ForwardIterator1 last1,
                                ForwardIterator2 first2,
                                ForwardIterator last2)
  {
      return __search(first1, last1, first2, last2,distance_type(first1),
                      distance_type(first2));
  }

  template<class ForwardIterator1, class ForwardIterator2, class distance1,
           class Distance2>
  ForwardIterator1 __search(ForwardIterator1 first1, ForwardIterator1 last1,
                            ForwardIterator2 first2, ForwardIterator2 last2,
                            Distance1*, Distance2*)
  {
      Distance1 d1 = 0;
      distance(first1, last1, d1);
      Distance2 d2 = 0;
      distance(first2, last2, d2);
      if(d1 < d2) return last1;
      ForwardIterator1 current1 = first1;
      ForwardIterator2 current2 = first2;
      while (current2 != last2) {
          if (*current1 == *current2) {
              ++current1;
              ++current2;
          }
          else {
              if (d1 == d2)
                  return last1;
              else {
                  current1 = ++first1;
                  current2 = first2;
                  --d1;
              }
          }
      }
      return first1;
  }
#+END_SRC
