cplusplus/STL-algorithms.html

<div id="outline-container-orgheadline56" class="outline-4">
<h4 id="orgheadline56"><span class="section-number-4">1.5.27</span> rotate<sub>copy</sub></h4>
<div class="outline-text-4" id="text-1-5-27">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">rotate_copy</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">middle</span>,
                           <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span>, <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> copy<span style="color: #7388d6;">(</span>first, middle, copy<span style="color: #909183;">(</span>middle, last, result<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline57" class="outline-4">
<h4 id="orgheadline57"><span class="section-number-4">1.5.28</span> search</h4>
<div class="outline-text-4" id="text-1-5-28">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #0000ff; font-weight: bold;">search</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">first1</span>,
                              <span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">last1</span>,
                              <span style="color: #00ff00;">ForwardIterator2</span> <span style="color: #ffff00;">first2</span>,
                              <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last2</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> __search<span style="color: #7388d6;">(</span>first1, last1, first2, last2,distance_type<span style="color: #909183;">(</span>first1<span style="color: #909183;">)</span>,
                    distance_type<span style="color: #909183;">(</span>first2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>

<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator2</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">distance1</span>,
         <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Distance2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #0000ff; font-weight: bold;">__search</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">last1</span>,
                          <span style="color: #00ff00;">ForwardIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">ForwardIterator2</span> <span style="color: #ffff00;">last2</span>,
                          <span style="color: #00ff00;">Distance1</span>*, <span style="color: #00ff00;">Distance2</span>*<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">Distance1</span> <span style="color: #ffff00;">d1</span> = <span style="color: #ff00ff;">0</span>;
    distance<span style="color: #7388d6;">(</span>first1, last1, d1<span style="color: #7388d6;">)</span>;
    <span style="color: #00ff00;">Distance2</span> <span style="color: #ffff00;">d2</span> = <span style="color: #ff00ff;">0</span>;
    distance<span style="color: #7388d6;">(</span>first2, last2, d2<span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>d1 &lt; d2<span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> last1;
    <span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">current1</span> = first1;
    <span style="color: #00ff00;">ForwardIterator2</span> <span style="color: #ffff00;">current2</span> = first2;
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>current2 != last2<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">if</span> <span style="color: #909183;">(</span>*current1 == *current2<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            ++current1;
            ++current2;
        <span style="color: #909183;">}</span>
        <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #909183;">{</span>
            <span style="color: #00ffff; font-weight: bold;">if</span> <span style="color: #709870;">(</span>d1 == d2<span style="color: #709870;">)</span>
                <span style="color: #00ffff; font-weight: bold;">return</span> last1;
            <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #709870;">{</span>
                current1 = ++first1;
                current2 = first2;
                --d1;
            <span style="color: #709870;">}</span>
        <span style="color: #909183;">}</span>
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> first1;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
