cplusplus/STL-algorithms.org
*** search_n

#+BEGIN_SRC C++
  template<class ForwardIterator, class Interger, class T>
  ForwardIterator search_n(ForwardIterator first,
                           ForwardIterator last,
                           Interger count, const T& value)
  {
      if(count <= 0) return first;
      else {
          //先找到第一个
          first = find(first, last, value);
          while (first != last) {
              Interger n = count - 1;
              ForwardIterator i = first;
              ++i;
              //找连续符合的元素，都找到了的话 n会等于0；
              while (i != last && n != 0 && *i == value) {
                  ++i;
                  --n;
              }
              if(n == 0) return first;
              else
                  first = find(i, last, value);
          }
          return last;
      }
  }
  template<class ForwardIterator, class Interger, class T,
           class BinaryPredicate>
  ForwardIterator search_n(ForwardIterator first,
                           ForwardIterator last,
                           Interger count, const T& value,
                           BinaryPredicate binary_pred)
  {
      if(count <= 0) return first;
      else {
          //自己实现find，其实可以使用find_if版本的 不过需要使用bind函数
          while (first != last) {
              if(binary_pred(*first, value)) break;
              ++first;
          }
          while (first != last)
          {
              Interger n = count - 1;
              ForwardIterator i = first;
              ++i;
              //找连续符合的元素，都找到了的话 n会等于0；
              while (i != last && n != 0 && *i == value) {
                  ++i;
                  --n;
              }
              if(n == 0) return first;
              else {
                  while (i != last) {
                      if(binary_pred(*first, value)) break;
                      ++i;
                  }
                  first = i;
              }
          }
          return last;
      }
  }
#+END_SRC
*** swap_ranges

注意：区间不能重叠，不然会产生未知结果
#+BEGIN_SRC C++
  template<class ForwardIterator1, class ForwardIterator2>
  ForwardIterator2 swap_ranges(ForwardIterator1 first1,
                               ForwardIterator1 last1,
                               ForwardIterator2 first2)
  {
      for(; first != last1; ++first1, ++first2)
          iter_swap(first1, first2);
      return first2;
  }
#+END_SRC
