cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline58" class="outline-4">
<h4 id="orgheadline58"><span class="section-number-4">1.5.29</span> search<sub>n</sub></h4>
<div class="outline-text-4" id="text-1-5-29">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Interger</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">ForwardIterator</span> <span style="color: #0000ff; font-weight: bold;">search_n</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>,
                         <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span>,
                         <span style="color: #00ff00;">Interger</span> <span style="color: #ffff00;">count</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">value</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>count &lt;= <span style="color: #ff00ff;">0</span><span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> first;
    <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #7388d6;">{</span>
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#20808;&#25214;&#21040;&#31532;&#19968;&#20010;</span>
        first = find<span style="color: #909183;">(</span>first, last, value<span style="color: #909183;">)</span>;
        <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #909183;">(</span>first != last<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            <span style="color: #00ff00;">Interger</span> <span style="color: #ffff00;">n</span> = count - <span style="color: #ff00ff;">1</span>;
            <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">i</span> = first;
            ++i;
            <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#25214;&#36830;&#32493;&#31526;&#21512;&#30340;&#20803;&#32032;&#65292;&#37117;&#25214;&#21040;&#20102;&#30340;&#35805; n&#20250;&#31561;&#20110;0&#65307;</span>
            <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #709870;">(</span>i != last &amp;&amp; n != <span style="color: #ff00ff;">0</span> &amp;&amp; *i == value<span style="color: #709870;">)</span> <span style="color: #709870;">{</span>
                ++i;
                --n;
            <span style="color: #709870;">}</span>
            <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #709870;">(</span>n == <span style="color: #ff00ff;">0</span><span style="color: #709870;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> first;
            <span style="color: #00ffff; font-weight: bold;">else</span>
                first = find<span style="color: #709870;">(</span>i, last, value<span style="color: #709870;">)</span>;
        <span style="color: #909183;">}</span>
        <span style="color: #00ffff; font-weight: bold;">return</span> last;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Interger</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span>,
         <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BinaryPredicate</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">ForwardIterator</span> <span style="color: #0000ff; font-weight: bold;">search_n</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>,
                         <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span>,
                         <span style="color: #00ff00;">Interger</span> <span style="color: #ffff00;">count</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ff00;">T</span>&amp; <span style="color: #ffff00;">value</span>,
                         <span style="color: #00ff00;">BinaryPredicate</span> <span style="color: #ffff00;">binary_pred</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>count &lt;= <span style="color: #ff00ff;">0</span><span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> first;
    <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #7388d6;">{</span>
        <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#33258;&#24049;&#23454;&#29616;find&#65292;&#20854;&#23454;&#21487;&#20197;&#20351;&#29992;find_if&#29256;&#26412;&#30340; &#19981;&#36807;&#38656;&#35201;&#20351;&#29992;bind&#20989;&#25968;</span>
        <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #909183;">(</span>first != last<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #709870;">(</span>binary_pred<span style="color: #907373;">(</span>*first, value<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #00ffff; font-weight: bold;">break</span>;
            ++first;
        <span style="color: #909183;">}</span>
        <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #909183;">(</span>first != last<span style="color: #909183;">)</span>
        <span style="color: #909183;">{</span>
            <span style="color: #00ff00;">Interger</span> <span style="color: #ffff00;">n</span> = count - <span style="color: #ff00ff;">1</span>;
            <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">i</span> = first;
            ++i;
            <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#25214;&#36830;&#32493;&#31526;&#21512;&#30340;&#20803;&#32032;&#65292;&#37117;&#25214;&#21040;&#20102;&#30340;&#35805; n&#20250;&#31561;&#20110;0&#65307;</span>
            <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #709870;">(</span>i != last &amp;&amp; n != <span style="color: #ff00ff;">0</span> &amp;&amp; *i == value<span style="color: #709870;">)</span> <span style="color: #709870;">{</span>
                ++i;
                --n;
            <span style="color: #709870;">}</span>
            <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #709870;">(</span>n == <span style="color: #ff00ff;">0</span><span style="color: #709870;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> first;
            <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #709870;">{</span>
                <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #907373;">(</span>i != last<span style="color: #907373;">)</span> <span style="color: #907373;">{</span>
                    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #6276ba;">(</span>binary_pred<span style="color: #858580;">(</span>*first, value<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> <span style="color: #00ffff; font-weight: bold;">break</span>;
                    ++i;
                <span style="color: #907373;">}</span>
                first = i;
            <span style="color: #709870;">}</span>
        <span style="color: #909183;">}</span>
        <span style="color: #00ffff; font-weight: bold;">return</span> last;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline59" class="outline-4">
<h4 id="orgheadline59"><span class="section-number-4">1.5.30</span> swap<sub>ranges</sub></h4>
<div class="outline-text-4" id="text-1-5-30">
<p>
注意：区间不能重叠，不然会产生未知结果
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator2</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">ForwardIterator2</span> <span style="color: #0000ff; font-weight: bold;">swap_ranges</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">first1</span>,
                             <span style="color: #00ff00;">ForwardIterator1</span> <span style="color: #ffff00;">last1</span>,
                             <span style="color: #00ff00;">ForwardIterator2</span> <span style="color: #ffff00;">first2</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first != last1; ++first1, ++first2<span style="color: #7388d6;">)</span>
        iter_swap<span style="color: #7388d6;">(</span>first1, first2<span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> first2;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
