cplusplus/STL-algorithms.org
*** transform

#+BEGIN_SRC C++
  template<class InputIterator, class OutputIterator, class UnaryOperation>
  OutputIterator transform(InputIterator first1, InputIterator last,
                           OutputIterator result, UnaryOperation op)
  {
      for(; first != last; ++first, ++result)
          ,*result = op(*first);
      return result;
  }
  template<class InputIterator1, class InputIterator2, class OutputIterator,
           class BinaryOperation>
  OutputIterator transform(InputIterator1 first1, InputIterator last1,
                           InputIterator2 first2, InputIterator last2,
                           BinaryOperation binary_op)
  {
      for(; first1 != last1; ++first1, ++first2, ++result)
          ,*result = binary_op(*first1, *first2);
      return result;
  }
#+END_SRC
*** unique

移除（remove）重复的元素。

#+BEGIN_SRC C++
  template<class ForwardIterator>
  ForwardIterator unique(ForwardIterator first, ForwardIterator last)
  {
      first = adjacent_find(first, last);
      return unique_copy(first, last, first);
  }
#+END_SRC
*** unique_copy


#+BEGIN_SRC C++
  template<class InputIterator, class ForwardIterator>
  inline OutputIterator unique_copy(InputIterator first,
                                    InputIterator last,
                                    OutputIterator result)
  {
      if(first == last) return result;
      return __unique_copy(first, last, result, iterator_category(result));
  }
  template<class InputIterator, class ForwardIterator>
  ForwardIterator __unique_copy(InputIterator first,
                                InputIterator last,
                                ForwardIterator result,
                                forward_iterator_tag)
  {
      ,*result = *first;
      while (++first != last) {
          if(*result != *first)
              ,*++result = *first;
      }
      return ++result;
  }
  template<class InputIterator, class OutputIterator>
  inline OutputIterator __unique_copy(InputIterator first,
                                      InputIterator last,
                                      ForwardIterator result,
                                      output_iterator_tag)
  {
      return __unique_copy(first, last, result, value_type(first));
  }
  template<class InputIterator, class OutputIterator, class T>
  OutputIterator __unique_copy(InputIterator first, InputIterator last,
                               OutputIterator result, T*)
  {
      T value = *first;
      ,*result = value;
      while (++first != last) {
          if(value != *first) { //如果result为只读，这里就只能通过值判断 而不能使用(*result != *first)
              value = *first;
              ,*++result = value;
          }
      }
      return ++result;
  }
#+END_SRC


