cplusplus/STL-algorithms.html
<div id="outline-container-orgheadline60" class="outline-4">
<h4 id="orgheadline60"><span class="section-number-4">1.5.31</span> transform</h4>
<div class="outline-text-4" id="text-1-5-31">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">UnaryOperation</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">transform</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                         <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, <span style="color: #00ff00;">UnaryOperation</span> <span style="color: #ffff00;">op</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first != last; ++first, ++result<span style="color: #7388d6;">)</span>
        *result = op<span style="color: #7388d6;">(</span>*first<span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> result;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator1</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator2</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>,
         <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">BinaryOperation</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">transform</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator1</span> <span style="color: #ffff00;">first1</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last1</span>,
                         <span style="color: #00ff00;">InputIterator2</span> <span style="color: #ffff00;">first2</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last2</span>,
                         <span style="color: #00ff00;">BinaryOperation</span> <span style="color: #ffff00;">binary_op</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">for</span><span style="color: #7388d6;">(</span>; first1 != last1; ++first1, ++first2, ++result<span style="color: #7388d6;">)</span>
        *result = binary_op<span style="color: #7388d6;">(</span>*first1, *first2<span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> result;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline61" class="outline-4">
<h4 id="orgheadline61"><span class="section-number-4">1.5.32</span> unique</h4>
<div class="outline-text-4" id="text-1-5-32">
<p>
移除（remove）重复的元素。
</p>

<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">ForwardIterator</span> <span style="color: #0000ff; font-weight: bold;">unique</span><span style="color: #707183;">(</span><span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">last</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    first = adjacent_find<span style="color: #7388d6;">(</span>first, last<span style="color: #7388d6;">)</span>;
    <span style="color: #00ffff; font-weight: bold;">return</span> unique_copy<span style="color: #7388d6;">(</span>first, last, first<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline62" class="outline-4">
<h4 id="orgheadline62"><span class="section-number-4">1.5.33</span> unique<sub>copy</sub></h4>
<div class="outline-text-4" id="text-1-5-33">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">unique_copy</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>,
                                  <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                                  <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>first == last<span style="color: #7388d6;">)</span> <span style="color: #00ffff; font-weight: bold;">return</span> result;
    <span style="color: #00ffff; font-weight: bold;">return</span> __unique_copy<span style="color: #7388d6;">(</span>first, last, result, iterator_category<span style="color: #909183;">(</span>result<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">ForwardIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">ForwardIterator</span> <span style="color: #0000ff; font-weight: bold;">__unique_copy</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>,
                              <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                              <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">result</span>,
                              forward_iterator_tag<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    *result = *first;
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>++first != last<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>*result != *first<span style="color: #909183;">)</span>
            *++result = *first;
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> ++result;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ffff; font-weight: bold;">inline</span> <span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">__unique_copy</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>,
                                    <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                                    <span style="color: #00ff00;">ForwardIterator</span> <span style="color: #ffff00;">result</span>,
                                    output_iterator_tag<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> __unique_copy<span style="color: #7388d6;">(</span>first, last, result, value_type<span style="color: #909183;">(</span>first<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
<span style="color: #00ffff; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">InputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">OutputIterator</span>, <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">T</span><span style="color: #707183;">&gt;</span>
<span style="color: #00ff00;">OutputIterator</span> <span style="color: #0000ff; font-weight: bold;">__unique_copy</span><span style="color: #707183;">(</span><span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">first</span>, <span style="color: #00ff00;">InputIterator</span> <span style="color: #ffff00;">last</span>,
                             <span style="color: #00ff00;">OutputIterator</span> <span style="color: #ffff00;">result</span>, <span style="color: #00ff00;">T</span>*<span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ff00;">T</span> <span style="color: #ffff00;">value</span> = *first;
    *result = value;
    <span style="color: #00ffff; font-weight: bold;">while</span> <span style="color: #7388d6;">(</span>++first != last<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #909183;">(</span>value != *first<span style="color: #909183;">)</span> <span style="color: #909183;">{</span> <span style="color: #ff0000;">//</span><span style="color: #ff0000;">&#22914;&#26524;result&#20026;&#21482;&#35835;&#65292;&#36825;&#37324;&#23601;&#21482;&#33021;&#36890;&#36807;&#20540;&#21028;&#26029; &#32780;&#19981;&#33021;&#20351;&#29992;(*result != *first)</span>
            value = *first;
            *++result = value;
        <span style="color: #909183;">}</span>
    <span style="color: #7388d6;">}</span>
    <span style="color: #00ffff; font-weight: bold;">return</span> ++result;
    <span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: hsin</p>
<p class="date">Created: 2017-06-20 二 17:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
